O-O 202296
Nf6 141456
Nf3 132146
d4 127624
Nc3 116170
d5 110300
e4 109941
c4 107763
c5 102594
e5 95040
Nc6 86838
e6 85300
g6 68018
Be7 66699
d6 65945
a6 65675
b5 65255
a4 63197
a5 62226
f4 60841
b4 58722
1-0 58461
f5 58411
Be3 57339
g3 56575
Bd3 55791
h6 54797
h4 54664
h5 53538
1/2-1/2 53179
cxd4 50645
c6 50248
Bg5 48780
h3 48611
Bg7 48339
b6 47646
Nxd4 46187
Ne5 46124
a3 46077
Re8 46027
g4 45598
Nd7 45295
cxd5 45208
Be2 44791
g5 44278
Qc7 44023
Re1 43408
Bb7 42946
Ne4 42611
b3 42594
Bd7 42497
Rc8 42116
e3 41845
Qc2 40796
exd5 40779
Nd5 40756
Bg2 39950
Qd2 39084
Kg7 38903
f3 38453
Rc1 36828
Be6 35531
Rd1 34525
Rd8 34515
Bd2 34262
Qe2 34065
f6 33853
Rb8 33619
Qe7 33214
Nbd7 33199
Bf4 32372
Nxd5 32332
Nc5 32071
Nd4 31566
Nd2 31435
Kg2 30998
Kf7 30801
Bd6 30324
c3 29697
Nxe4 29464
Ke7 29133
Kf8 28903
Nc4 27226
Bb4 26457
Kf2 26265
Bb5 26202
dxe5 26162
Rb1 26071
Qd7 25965
Qb6 25942
Bc4 25921
Bf5 25832
Nb6 25391
Bg4 25041
Nxe5 24944
Bxf6 24231
Kh8 24150
Ne7 23816
Rc7 22856
Kh7 22698
Qb3 22665
Rd7 22608
Kf6 22422
Kg8 22228
Qd3 22213
dxc4 22181
Ne2 21707
dxc5 21521
Bc5 21485
O-O-O 21414
Nf5 21305
Rd2 21117
Bb2 20930
Bf6 20900
Ke2 20880
Bc6 20765
Bxc4 20692
Nf4 20532
exd4 20465
Bb3 20107
Qa5 19824
Kf3 19720
Kh2 19659
Nb3 19592
axb5 19281
Nd3 19257
Ke3 19209
Ra8 19076
Ne6 19065
Bd4 18930
bxc3 18899
Qf3 18773
Kh1 18749
Bxd5 18721
Kf1 18617
Nd6 18577
Ke6 18289
Bf8 18283
Ne3 17995
Re7 17832
Rc2 17787
Qe3 17765
Rad1 17736
Bf3 17569
d3 17303
Qf6 17248
Qd6 17208
Be4 17194
Kg6 17108
Ng5 17017
Ng4 16823
Ra7 16808
Bxe4 16712
Rf8 16707
Bc2 16701
Bd5 16621
Nb5 16255
Kd7 16230
Qd8 16221
axb4 16137
Ba6 15989
Kg3 15950
Bc3 15937
Ra1 15815
Be5 15726
Kd6 15679
Bxf3 15438
Na5 15402
Rd3 15384
dxe4 15251
Bxe5 15233
0-1 15232
Kd3 15091
Re2 15021
Nbd2 14957
Bxc5 14943
Bf1 14933
Nb4 14917
Bxd4 14895
Rd6 14863
Nh5 14842
Ng3 14685
Rfd1 14409
Qxd4 14336
Na4 14188
Ng6 13949
Rb7 13933
Bh4 13746
Rc6 13711
Nc7 13689
Rf1 13688
Rf7 13517
Rd4 13427
Kg1 13410
Kd2 13389
Rac1 13370
Na6 13328
Rc5 13284
exf5 13242
Rg8 13102
Qc6 13074
Re3 13047
Qd4 13003
Ke5 12940
Rc4 12918
Bh6 12875
Bxc6 12777
Qc3 12752
Ke4 12729
Nxc3 12595
fxe5 12588
Bg3 12569
hxg5 12543
Bxc3 12534
Rac8 12527
Rc3 12496
Ne8 12454
Qg4 12415
Rd5 12380
Qxd5 12358
Ba4 12341
Qf4 12282
bxc6 12227
Rad8 12169
Qe6 12158
Kf5 12100
Rb6 11972
fxe4 11946
Ra2 11945
Bg6 11911
Qa4 11908
Kf4 11892
Re6 11858
bxc5 11853
Qc5 11842
Qe4 11813
Ra6 11763
gxf5 11755
Bc8 11746
Qc8 11733
Ra3 11655
Kd4 11415
Qe5 11395
Nxc5 11267
Nf8 11251
Rfd8 11223
Nxc6 11206
Ke8 11143
Qh4 11117
Rxd5 11112
Bb6 11041
Qe8 11017
Kc7 10965
Kb1 10963
Qb7 10833
Qh5 10833
Qd5 10832
bxc4 10811
Rfe1 10712
Rg1 10664
hxg4 10564
Ra5 10561
Rb2 10561
Qf5 10508
Rb3 10492
Qc4 10437
Re5 10431
Kd5 10415
Rb4 10414
Ra4 10406
fxe6 10371
Qg5 10343
Re4 10275
Qg3 10246
Rb5 10193
Qb4 10181
Rxd4 10164
Bf2 10069
Rfe8 10019
Qd1 9964
Bxf5 9941
gxf6 9906
Nh4 9900
Qf2 9887
Rf2 9810
Kc6 9777
Rf3 9774
Qxc4 9626
Kg5 9551
Bh3 9510
hxg6 9461
Qb8 9402
Kc3 9335
Rf6 9330
Bc7 9259
Rxe5 9258
exf4 9258
Nxc4 9161
Qf7 9139
Kc2 9127
gxf4 9115
Rh8 9106
Rxd6 9096
Kg4 9033
Kh6 9028
Nc2 8977
Ba3 8969
Rxd8 8767
Qxd6 8718
Rxe4 8716
Be8 8706
Qxe4 8682
Qb5 8660
Bd8 8613
cxb5 8565
Bc1 8466
Bxf4 8465
Nf1 8396
Qxe5 8284
Kc5 8255
Qxf6 8235
Rh1 8200
Qxc3 8149
Qe1 8137
Rxc5 8133
Bxd6 8127
Rxd1 8118
exf6 7967
Qg6 7953
Rf4 7945
axb3 7938
Kc4 7891
Qc1 7861
Rxc4 7837
Qb2 7676
Kd8 7630
Qxc5 7597
Rf5 7592
Bh5 7477
Bxe6 7448
Kh3 7427
Ne1 7352
Rg3 7235
Bxb5 7194
Na3 7135
Rxc6 7113
Rfc8 7056
Qxd3 6979
Qa3 6958
Bxe7 6942
Nxe6 6940
Rxc3 6896
Rxc8 6896
Rxb7 6881
Qxe7 6869
Nxf6 6824
Rxe6 6731
Bf7 6716
Nfd7 6709
Bxg5 6708
Rxc1 6667
Rh3 6622
dxc6 6616
Bb4+ 6606
Qa6 6579
Nxd7 6574
Qxf3 6574
Nf7 6548
Ke1 6510
Bxd3 6456
axb6 6434
Rg7 6343
Nb8 6336
Rg6 6327
hxg3 6327
Rxd7 6309
Rae1 6206
Be1 6171
Rfc1 6138
Qh3 6130
Kxg7 6129
Kb6 6082
gxf3 5989
Rxa5 5938
Bd1 5907
Kb8 5900
Rh4 5888
Nge2 5882
Rae8 5873
Rab8 5829
Ba5 5743
Kb7 5706
Bxg7 5701
Nxf5 5683
Nxb5 5672
Rxf6 5645
gxh5 5639
cxb4 5623
Nxd6 5571
Qh6 5527
Rxa4 5519
Rxa6 5517
Rh6 5516
Qxc6 5497
Rxf5 5487
Qf8 5481
bxa4 5478
Nf2 5473
Rab1 5465
Rg4 5464
Qa7 5457
Nxf4 5456
fxg6 5450
Rh5 5441
Qb1 5431
Rxb2 5427
Kb3 5411
Rxa7 5403
Bb1 5395
Kb2 5385
Rh7 5362
Rxe7 5362
Bxc3+ 5320
Bxg2 5283
Nh6 5230
Rxc7 5207
Bxa6 5161
Rxd3 5160
Rg5 5154
Nd8 5138
Bxb4 5135
Rxf4 5131
Nxf6+ 5112
fxg4 5079
fxg5 5061
Rxf7 5031
Rxb4 5004
Qxd7 5003
Nc8 5002
Rxb5 4982
bxa5 4944
Kb5 4942
Rxe3 4932
Bxb7 4918
Qxb7 4911
dxe6 4885
Rg2 4864
Qxd2 4858
Bxe3 4840
Kxg2 4835
Qxf4 4828
Kb4 4827
Nd1 4821
Kc8 4815
Bxg4 4747
Qxb4 4735
Rxd2 4733
cxd6 4715
fxe3 4698
Qxf5 4674
exd6 4655
Rh2 4642
Rxb6 4641
Rxa2 4583
Qxb5 4556
Qxb6 4540
Nh7 4502
Qg7 4498
Kd1 4462
Qxb2 4459
Qxe6 4382
Rxe8 4366
Rxc2 4360
Ng7 4332
Nxe3 4330
Kh5 4314
Nh3 4307
Bb5+ 4289
Kh4 4243
Qxe3 4241
Qa8 4197
gxh4 4172
Rxa8 4158
Nxg5 4153
Nxb4 4137
Rxe1 4135
Bxd7 4095
Nxb6 4068
Rxf3 4044
Nxd2 4007
Bxb2 3973
Bxh6 3962
Bxe2 3940
Qxg5 3935
Nb7 3924
Ba2 3903
Ngf6 3880
Rd8+ 3868
Nc1 3864
Rxb3 3858
Nxd3 3839
Qa2 3800
Rxa3 3730
Rxd8+ 3704
Rxe2 3692
Kc1 3647
Rd1+ 3597
Qxb3 3596
Qxa5 3595
Ng8 3560
Nxg6 3545
Qxe2 3500
Nge7 3473
Nxb3 3461
Re1+ 3454
Rhe1 3437
Rxa1 3421
Nxg4 3387
Qg2 3344
Qxd8 3337
Ba7 3329
Rxf2 3329
Nxa4 3318
Nf6+ 3269
Qxa4 3260
Rxd1+ 3254
fxg3 3244
Qd4+ 3212
Qxg4 3208
Qa5+ 3197
Kxf7 3177
Nh2 3169
Re8+ 3166
Bxd2 3160
Bxb6 3145
Qa4+ 3134
Rxh5 3120
Rc8+ 3109
Bxg6 3105
Qf1 3066
Qxc7 3042
Qe5+ 3010
Qxa6 2995
Bb8 2984
Qd5+ 2973
d7 2958
Nb1 2957
Qxd1 2949
Qe4+ 2930
exf3 2917
Qg5+ 2907
Nxf3 2893
Nb2 2868
Rxb8 2839
bxa6 2819
Rxh4 2797
Bxb3 2796
Rd7+ 2792
Qa1 2789
Bxf8 2788
Qxa2 2777
Rc1+ 2755
Nxg3 2749
cxb3 2735
Red1 2732
Ba8 2731
bxa3 2725
Rc7+ 2712
Bxa4 2709
Rxg5 2695
Nxa5 2691
Nxe7 2676
Rxe8+ 2670
cxd3 2640
Qxc2 2620
Nxf3+ 2616
a7 2609
Qxa7 2605
Bh7 2602
Ka2 2575
Red8 2532
Nxf7 2507
Rxg4 2478
Qg4+ 2465
gxh6 2442
Ra7+ 2423
Qd8+ 2417
Ng2 2409
Qe6+ 2406
Bxc8 2403
Rxg7 2401
Na7 2395
Rxe1+ 2388
Bxd8 2385
cxb6 2376
Rxh6 2374
Qh5+ 2370
dxc3 2370
Rxf8 2363
Rcd1 2362
Rxh7 2362
Nd6+ 2357
Nxb7 2353
Bxd2+ 2342
Qxh6 2328
Qxh5 2322
Bxf1 2305
Re7+ 2299
Qh4+ 2290
Rxg6 2276
Ngf3 2274
Na2 2273
Bxa5 2270
Qf5+ 2263
Kxd8 2261
Ka7 2258
Rb7+ 2251
Rf1+ 2251
Qf4+ 2241
Rxb1 2241
Kxf6 2234
Rc2+ 2234
Rd2+ 2211
Bg1 2209
Qe3+ 2203
Ndb5 2197
Qxc8 2194
Nxh5 2167
Rb8+ 2158
b7 2157
Rg1+ 2140
Qe8+ 2137
Qc8+ 2133
Qf6+ 2132
Rf7+ 2132
Bxa3 2116
Bxh4 2115
Qd1+ 2108
Rg8+ 2108
Kxf8 2105
Nf5+ 2100
Ra2+ 2100
Qc1+ 2099
Rb1+ 2093
Qc5+ 2092
Bxh3 2091
c7 2089
Rf8+ 2085
Qxh4 2072
Qe1+ 2054
Rxf8+ 2050
Rhd1 2048
Rfb8 2044
Nxa6 2026
Ne7+ 2025
Qxd8+ 2016
Kxf2 2009
Rcd8 2004
Qxa3 2001
Rxc8+ 1991
Bh2 1988
Bxg3 1985
Nf3+ 1976
Qxf7 1973
Rb2+ 1963
Re2+ 1947
Rxf1 1944
Bxh5 1942
Rg7+ 1933
Ka1 1912
Nxc8 1911
Qxg6 1911
Ra8+ 1900
Ne5+ 1895
Rde1 1893
Qc3+ 1891
Bxc7 1888
Qg6+ 1882
Ka3 1881
Qh6+ 1865
Qc4+ 1864
Ka6 1859
Ne4+ 1859
Ra3+ 1855
Qe7+ 1842
Kxe7 1838
Nxb2 1837
Rxh2 1835
Qb8+ 1822
Qa1+ 1809
Bxa8 1808
Ra6+ 1808
Nd5+ 1800
Nxc7 1794
Qc7+ 1792
Bxd7+ 1791
Ne6+ 1783
Rxg3 1775
Nf4+ 1774
Kxf1 1760
Rxh3 1755
Qd6+ 1751
Qb1+ 1750
Ka4 1747
Rxg2 1744
Bxc1 1741
Ra1+ 1736
Ka5 1729
Qh8+ 1729
Qd3+ 1724
Rd6+ 1711
Qxe8 1709
e7 1709
Bg8 1702
Ng1 1692
Bxa7 1690
Nxe7+ 1680
Ndf6 1678
Nxg7 1676
Kxf3 1670
Qb6+ 1662
Qg3+ 1656
Bxc2 1649
Rh7+ 1647
Bd4+ 1644
Qb7+ 1642
Kxd2 1632
Rh8+ 1632
Qc2+ 1627
Qc6+ 1627
Rf2+ 1624
Ka8 1622
Nbc6 1619
Qa8+ 1614
Rfb1 1614
Qh7 1611
Nxe2 1605
Rf6+ 1601
Ba1 1597
Rg3+ 1592
Kxf5 1590
Qd7+ 1589
Rc6+ 1588
Nd3+ 1584
Qh2 1584
Rec8 1577
Nxh4 1576
Rg6+ 1567
Rxf1+ 1566
Rb6+ 1561
Rdc1 1553
Qxe6+ 1548
Bxf7 1546
Rb3+ 1544
Kxh7 1539
Rhe8 1538
Re6+ 1537
Qe2+ 1536
Qxg7 1528
Kxf4 1524
Nxf2 1524
Rc3+ 1519
Bxd1 1511
Nd4+ 1509
a2 1502
Kxg6 1497
Rd3+ 1485
Nce2 1483
Qh7+ 1480
Qxf2 1478
Rbc8 1468
Qf7+ 1466
Kxd7 1464
gxh3 1453
Rg2+ 1452
Qb2+ 1451
Rf3+ 1446
c2 1445
Qxc1 1444
Qd2+ 1441
Rde8 1439
Qf3+ 1437
Qxg3 1435
b2 1434
Kxe5 1433
Kxe6 1424
Kxg5 1424
Ng5+ 1419
Rxc1+ 1411
Qb3+ 1410
Qg8 1406
Bxa2 1404
h7 1393
Qf8+ 1388
Rhd8 1388
Rxf7+ 1386
Re3+ 1385
Qxa8 1383
Rg5+ 1383
Kxg4 1382
Nxd8 1378
Rf4+ 1375
Ne2+ 1369
Kxe4 1360
Qxf7+ 1344
Rhf1 1343
d2 1343
Rf5+ 1340
Bxf7+ 1339
Rg4+ 1339
Ne3+ 1330
Rbd1 1322
Nxg2 1320
Qh1+ 1316
Rbc1 1314
Rhg1 1310
Rdc8 1302
Bc5+ 1283
Bxe8 1279
Rh6+ 1279
Rec1 1270
Rh2+ 1270
Bd5+ 1268
Nce4 1267
Qf1+ 1267
Nxe8 1263
Re5+ 1263
Bc4+ 1260
Raf8 1258
Re4+ 1258
Rbd8 1247
Kxh5 1244
Nde2 1233
Kxh6 1223
Qh3+ 1221
Rh1+ 1216
Qxe1 1208
Nxa7 1204
Rxg7+ 1203
exd3 1199
Nxd1 1196
Qg8+ 1194
Kxg3 1193
Qg1 1190
Qxh3 1184
Rh3+ 1181
Nxc2 1175
Kxh4 1170
Qxd1+ 1164
Qg1+ 1157
Kxe3 1147
Raf1 1145
Bxf2 1140
Nfd2 1137
Nbd5 1131
Kxe2 1130
Ng4+ 1129
Nxa3 1123
Bh8 1117
Rd4+ 1116
Kxd6 1112
Nxf8 1110
Bxc6+ 1109
Qa7+ 1103
Qb4+ 1102
Qf2+ 1100
Nc4+ 1099
Qxe5+ 1095
Ra4+ 1088
Nc5+ 1085
Ra5+ 1078
Qxg6+ 1074
e2 1074
Bxa1 1072
f5+ 1071
Kxd5 1068
Qxd5+ 1068
Qxe4+ 1065
Qxd2+ 1064
Rd5+ 1053
Nf7+ 1043
dxe3 1032
Kxd1 1030
Qxa1 1021
Nh6+ 1018
Qb5+ 1016
Rc5+ 1005
h2 998
Qh2+ 997
Rc4+ 997
Qxh7 996
Qxg2 995
f7 986
Nxa2 977
Qxf6+ 967
Bxh7+ 966
Rhg8 966
g5+ 964
Bxe1 963
Nxh6 957
f4+ 957
Bxe6+ 955
Rb5+ 943
Rxh8 938
Nxc1 937
g7 936
Qh8 935
Qg7+ 932
Nhf6 931
Nc6+ 925
Qxb8 925
Qxf2+ 923
Qxd4+ 919
Qxe3+ 919
Rcc8 917
Rce8 914
Rb4+ 911
Rxh1 911
Rxg6+ 903
Nce7 889
Kxd4 888
Bxf2+ 885
Ng6+ 885
Be6+ 884
Qa2+ 883
Rdd1 882
Qxf8 881
Nfd5 868
g4+ 868
Kxc5 863
Ned7 860
Nxh7 855
Nxa8 854
Rh5+ 851
Kxh2 848
f6+ 848
Ndf3 847
Rhc1 841
Qh1 840
Kxc4 839
Ree8 839
Rhc8 839
Kxh3 835
Nd7+ 835
Rce1 833
Rh4+ 826
Bxd4+ 825
Rxf2+ 824
Nbd4 819
Kxd3 816
Nbc3 815
Qg2+ 815
Bxb8 804
Bxd5+ 803
Na8 803
Be5+ 790
Rhf8 789
Raa8 785
Nce5 781
Rbe8 780
Nfd4 779
Nc3+ 778
Qxg7+ 777
Nde5 776
Rdd8 775
Rxg2+ 771
Bg5+ 764
Rdf1 764
Ncd7 759
Be4+ 754
Nxe2+ 753
Kxb4 744
Kxc6 739
Bxh7 732
Nxe1 732
Bxe3+ 730
Qa3+ 726
f2 725
Rxg8 720
Kxc3 715
Nf2+ 711
Qxg5+ 710
Kxe8 703
exf7+ 699
Nh3+ 698
Rxd7+ 698
Rbe1 696
Be3+ 691
Bh6+ 691
Ree1 688
Bh1 687
Bf5+ 686
Rxe7+ 681
e5+ 680
Nge4 678
Bxb1 676
Kxb5 674
g2 673
Kxc7 671
Nde4 669
Qxh2 669
Rcc1 668
Rdg1 668
Rxe6+ 663
Nd2+ 662
Ng3+ 659
Rdd7 653
fxg7 653
N8d7 650
Bh7+ 649
Nc7+ 646
Reb8 643
Kxb7 641
Nge5 638
Nxf1 638
Nh5+ 636
Nxd6+ 635
Bf4+ 633
Qxf3+ 631
Qxc3+ 619
Bxg7+ 618
Nxh3 616
Qxh6+ 616
Bd6+ 614
Nxe6+ 614
h5+ 606
Qa6+ 605
Qxh7+ 604
Rdf8 604
Rbb8 602
Nxb8 601
Qxg3+ 600
Rxh7+ 600
Rfa1 599
hxg5+ 596
Kxb2 595
h4+ 594
Kxc2 592
Kxg8 592
Qxe7+ 592
Rcc7 591
Kxa5 583
hxg4+ 580
Nef6 578
Bd3+ 575
Nfe4 575
Rxg3+ 573
Qxe2+ 570
Ncd5 569
Qxb1 562
Ree7 560
Qxd7+ 557
Qxf5+ 554
exf6+ 554
Reb1 552
Rxf6+ 551
Qxg4+ 549
Qxf1 546
R1d2 542
Kxb3 538
Raa1 536
Nbxd4 532
d6+ 531
Qxg2+ 530
Kxb6 529
Nxd3+ 526
hxg6+ 525
Nc2+ 524
Nh8 524
Nfe5 521
e4+ 521
Rxg5+ 520
Bxf6+ 518
a8=Q 514
Bxh2 510
Nxh6+ 509
Rxg1 509
e6+ 509
Ned5 504
Rdg8 503
Rcb8 502
Bxh2+ 499
Qxf4+ 498
Rfa8 498
f3+ 498
Qxc5+ 494
Kxa4 492
Kxa6 491
Ndc5 491
N6d7 490
Bf6+ 488
Nec3 488
Qxh5+ 488
Qxf8+ 487
Rxg4+ 487
Nb5+ 484
Ned4 484
Nh4+ 484
Rxc7+ 481
Rxe2+ 481
h6+ 481
Rxb7+ 480
Bh5+ 478
Rxe5+ 471
Rxf5+ 470
Nec6 469
Nxh2 469
Qxe8+ 469
gxf4+ 463
Ne8+ 462
Nce3 457
Bc3+ 455
N1c3 455
Rff8 455
Rdd2 454
Kxe1 453
Qxc6+ 453
Bc6+ 452
Bxe5+ 450
Bg4+ 446
Nh1 445
Rxh6+ 445
Nb4+ 443
N7f6 442
Nac5 439
Red2 439
Rxf3+ 439
Bxh8 434
Rxd6+ 434
Qxc4+ 433
Rxe4+ 432
Rxf4+ 428
Rxb2+ 427
Rxc2+ 427
Bg6+ 426
Bh4+ 425
Rag8 425
Nxa1 422
Nxf5+ 421
Rxg8+ 420
Nb6+ 418
Rxb8+ 417
gxf5+ 417
Bxb5+ 415
Rxd2+ 414
b8=Q 410
dxe7 410
g6+ 410
Rdb8 406
Rcd2 402
fxe5+ 400
Ndxe5 399
Ncxe4 397
Nfxd5 397
Rbb1 394
Bxg2+ 393
Qxe1+ 393
c5+ 393
Qxc8+ 391
gxf7+ 390
Nxe5+ 389
Qxd6+ 385
Qxh4+ 382
Bxc5+ 381
gxf6+ 381
Rcc2 380
Nbxd5 378
Rdc2 374
Ref1 374
Kxg1 372
c4+ 372
Nxg6+ 367
Rxa8+ 367
Kxa3 366
Rea1 364
Bb6+ 361
Nac4 361
hxg3+ 361
Nxf4+ 360
Nxf7+ 358
Rdb1 358
Nb3+ 357
Ree2 356
Rxh2+ 354
Nxd5+ 353
Rbb7 352
Bxe4+ 348
Rxh5+ 348
d8=Q 348
Ref8 346
e3+ 346
Bb3+ 343
Rcb1 343
N5f6 341
c8=Q 341
Red7 340
Kxh8 336
Neg5 335
Ndc4 334
Nxe4+ 334
Rff1 334
Rfxd8 333
Rcd7 332
Ne1+ 330
a1=Q 330
Ncxe5 329
Bh3+ 327
Rxc6+ 327
Rxa7+ 326
Rxd5+ 325
Nxb1 323
Qxh2+ 322
Rff7 321
cxb7 320
Kxa7 317
Rfxd1 317
fxe4+ 317
Rxh4+ 316
Bxg6+ 314
Bf3+ 313
Rag1 313
hxg7 313
Nbxd2 312
Qxc2+ 311
R1c2 311
Rde2 311
Rxe3+ 311
Raxc8 310
Na1 309
Raa7 309
Rcf8 309
Rxb1+ 309
Bf7+ 307
Bh2+ 307
fxg5+ 307
Qxb7+ 305
Nxh3+ 303
Rhb1 303
b5+ 303
Bxh1 302
Rxh3+ 301
Bxf3+ 300
Bxf5+ 300
Nf8+ 300
Qxb2+ 300
Ned2 298
Nxe3+ 297
cxb2 297
Ba4+ 296
Bxc4+ 296
Kxc1 296
Qxc7+ 296
Qxh3+ 296
Rxc3+ 296
Kxc8 295
Qxc1+ 294
Rdh1 292
Ncb4 290
N2f3 289
N7b6 289
dxc7 289
Ncb5 287
d5+ 287
d4+ 286
Kxa2 285
Ncd4 284
b1=Q 284
Ndxe4 283
Rxb3+ 282
Rcf1 281
exf4+ 281
Ngxe5 279
Qxf1+ 279
Rxa1+ 279
fxg4+ 279
Qxb4+ 277
Nbc4 275
c1=Q 275
g3+ 274
Rxd4+ 273
Qxh8 272
R1e2 272
Rde7 272
f7+ 272
fxg6+ 272
b4+ 270
Nbxd7 269
exf3+ 268
Nd8+ 266
Ndb4 266
Rdc7 265
Nfxd4 264
d3+ 263
N1f3 262
R8d7 262
Rhb8 261
exf2+ 260
Rfe7 258
Bxb4+ 257
h8=Q 256
Nxb3+ 255
Rea8 255
gxh5+ 254
Bxg5+ 253
Rxa2+ 253
h3+ 253
Ba3+ 252
Nxg3+ 252
Rxg1+ 251
fxg2 250
Neg4 248
fxg3+ 248
Ncxd5 247
Nfg5 246
axb7 245
Nac7 244
Nxg5+ 244
Rbf8 244
exf5+ 244
N1d2 242
Nf1+ 242
Qxb5+ 242
R8c7 242
Rxc4+ 242
Raxd1 241
Qxh1 240
Raxd8 240
Rxb6+ 240
Bxf4+ 239
Nxc6+ 239
Rbf1 239
Red3 238
Rge8 238
Be7+ 237
Nd1+ 237
Ng7+ 237
R8e7 237
Ba6+ 236
Rxd3+ 236
R3d2 234
Nde7 233
Nec4 231
Bf2+ 230
N1e2 230
Nec5 230
Rxc5+ 230
Rbc7 229
Rda1 227
O-O-O+ 226
Qxa7+ 226
gxh4+ 226
h1=Q 224
e8=Q 223
Ba5+ 221
Bxd6+ 221
Nfg4 221
gxf3+ 221
Bg3+ 219
Rec7 219
exf7 219
Bd7+ 217
Nhf5 217
Rff2 217
N5c3 216
Rge1 216
axb2 216
fxe7 216
Be8+ 215
Ncd2 215
Nxh8 214
Rce7 214
axb4+ 214
Bc2+ 213
Bg7+ 213
Rdd3 213
Qxd3+ 211
c6+ 211
Nxc3+ 210
Qxb8+ 210
Ned3 209
Rbb2 209
Rfd2 209
Nbc5 207
e7+ 206
Rxa6+ 205
Nexd5 204
Nh7+ 203
Qxa8+ 203
Qxa2+ 202
Rdd6 202
Rfe2 202
Rgf8 201
Bf8+ 200
Rca8 200
Rgd1 200
Rab7 199
f8=Q 199
Rgf1 198
Rxh8+ 198
Bxd3+ 195
Ncxd4 195
Ng2+ 195
exd5+ 195
Rec2 194
Bxg8 192
Ndf8 192
Ngxe4 192
exd7 192
gxh6+ 192
Nfxe4 191
Nhf4 191
Na4+ 190
Rac7 190
Rgg8 189
Bxe7+ 188
Nef4 188
Ree3 188
b6+ 188
gxh7+ 188
Nxg4+ 187
Nac6 186
Nfe8 186
Nxg8 186
g8=Q 185
Nxf2+ 184
h7+ 184
Bc7+ 183
Bd8+ 183
Bxb7+ 180
Raxc1 180
Nc8+ 179
Nef5 179
Nxc5+ 179
Rba8 179
Nxg7+ 178
Rgd8 178
d7+ 178
Bxg1 177
Rfd7 177
Qxb6+ 176
Rcd3 176
fxe6+ 176
Bd2+ 175
Be2+ 175
Na5+ 173
Nxc4+ 173
Na3+ 171
Nxd4+ 171
Ref7 171
Rxb4+ 171
Kxh1 170
Nb7+ 170
Nfe3 170
Rce2 169
f1=Q 169
Rca1 168
Ref2 168
Rhh1 168
Nb2+ 167
Ncb6 167
Nce8 167
R1d3 167
Nhf3 166
N2b3 164
e1=Q 164
N5b6 163
Rhh8 163
Nce6 162
Ree6 162
a5+ 161
Qxb1+ 160
Raa2 160
Ncd3 159
Ncd6 158
Nxc7+ 158
c3+ 158
Nh2+ 157
Nfe6 156
Rae7 156
g1=Q 156
Ned6 155
axb5+ 155
cxd7 155
Nexd4 154
Nfe7 154
b3+ 154
dxe6+ 154
N4d5 153
Qxa1+ 153
Rcc6 153
d8=Q+ 153
hxg2 153
Kxb8 151
Nde3 151
R8f7 151
N3h2 150
Rcc3 150
Rxa3+ 150
Rda8 148
Ndc3 147
Rah1 147
bxc5+ 147
Bxh6+ 146
Qxb3+ 146
Rfd3 146
Rgc8 146
Nac3 145
Ndc6 145
R1f2 145
Ndb6 144
Rbd7 144
Rdf2 144
Rfe3 144
d1=Q 144
dxc2 144
Bb7+ 143
N1h2 143
Nc1+ 143
Nfxe5 143
bxc7 143
gxf7 143
Bxb2+ 142
Ndxc5 142
Rfxc8 142
Bb2+ 141
Qxg8+ 141
Rdh8 141
Ndxb5 140
Qxg8 140
R4d2 140
Bxg3+ 139
Ngf5 138
Rbc2 138
Qxa6+ 137
Qxa4+ 136
Rbd2 136
Bg8+ 135
Nbd3 135
exf2 135
Na6+ 134
Nxh7+ 134
Nfe2 133
Bf1+ 132
Ndf4 132
Ndf5 131
Nxh5+ 131
Rcg1 131
Nab6 130
Ndb8 130
R6e7 130
Rcb7 130
Rae2 129
Rgg7 129
R6d7 128
Rde3 128
Rxb5+ 128
Rba1 127
a4+ 127
R8b7 126
Rcg8 126
dxe5+ 126
exd6+ 126
Nfd3 125
Rff3 125
Rfg8 124
Rdd4 123
gxh3+ 123
Be1+ 122
Rbb6 122
bxc4+ 122
Nxd7+ 121
Rfg1 121
Nhf8 119
R1b2 119
Naxc5 118
Ng8+ 118
Qxg1 118
Bg2+ 117
Nxh1 117
Rcc4 117
Rxa5+ 117
e8=Q+ 117
Nef3 116
R8a7 116
Rad7 116
Rxh1+ 116
dxe2 116
Bd1+ 115
Red6 115
Rgg1 115
bxa7 115
N5f3 114
Nxh4+ 114
R3e2 114
Rcc5 114
N2c3 113
Nba6 113
Neg8 113
bxc3+ 113
f2+ 113
N3d2 111
Nxg1 111
R1a2 111
Rce3 111
Rbc3 110
hxg7+ 110
Naxc4 109
Nbd6 109
Qxh8+ 109
e2+ 109
g7+ 109
Rah8 107
Rha1 107
fxg7+ 107
gxf2+ 107
N8h7 106
Nec7 106
Nfg6 106
Rad2 106
exd7+ 106
Bxg4+ 105
Nxe8+ 105
Rfc2 105
bxa2 105
c8=Q+ 105
Rdd5 104
R1c3 103
Rgf7 103
dxe4+ 103
exd4+ 103
Qxg1+ 102
R6c7 102
Rdc3 102
Rdc6 102
Reg8 102
Bc1+ 101
R1e3 101
Rdf7 101
a8=Q+ 101
f8=Q+ 101
N4f3 100
R3c2 100
Rbc6 100
Rde6 100
Bc8+ 99
Nde6 99
R1d4 99
Rac2 99
Rxa4+ 99
dxc5+ 99
Neg6 98
R5d2 98
R6f7 98
Kxb1 97
Rab2 97
bxc2 97
cxd5+ 97
Nab5 96
Reg1 96
Rfc7 96
a6+ 96
Ndf1 95
Rdf3 95
Qxa5+ 94
Rac3 94
Rcb2 94
Ree4 94
axb3+ 94
Nhg4 93
Nxc8+ 93
Rbd3 93
Rbg1 93
Rcd6 93
Ref3 93
b8=Q+ 93
cxd2 93
N8e7 92
Ngf4 92
Rab3 92
Raf7 92
Nxd2+ 91
Rdb7 91
Rec3 91
Rfe6 91
Rff6 91
Nab4 90
Ncd1 90
Ndb3 90
Nxc2+ 90
Rbe7 90
c1=Q+ 90
Kxa8 89
N7c6 89
Ngf8 89
Rgf3 88
Rhh7 88
Bg1+ 87
R6d2 87
Rch1 86
Reb7 86
cxb5+ 86
d1=Q+ 86
gxh7 86
N3d4 85
R5d3 85
Rcf7 85
gxh2+ 85
Nxg2+ 84
Nxh2+ 84
c7+ 84
N8c6 83
R8e6 83
Bxh5+ 82
Raxb8 82
Nge6 81
R8d6 81
Rfb7 81
Rfxf7 81
R4d3 80
R8c6 80
Rab6 80
Rba7 80
dxc6+ 80
Ncxb5 79
Rac5 79
cxb4+ 79
Bxe2+ 78
Qxa3+ 78
Red4 78
Nab1 77
Nfxd2 77
Ngf1 77
R3f2 77
Rbxc8 77
Rdb2 77
cxd4+ 77
Rbg8 76
Rfxe8 76
fxe2 76
fxg2+ 76
N2g3 75
N5d4 75
Ncb8 75
R1c4 75
Rac6 75
Ree5 75
Rfd6 75
Rge3 75
Raa6 74
Rdxd6 74
fxe3+ 74
gxf2 74
hxg2+ 74
Ba7+ 73
Bxh3+ 73
Ndb1 73
Nxb5+ 73
Nxb6+ 73
Nxf8+ 73
R4e2 73
g8=Q+ 73
h2+ 73
R4c2 72
R5e3 72
Rdxd7 72
dxc4+ 72
Nba4 71
Ndxc4 71
Nge3 71
Nxa2+ 71
Rbf7 71
Rexd8 71
Rhxf1 71
axb6+ 71
N2c4 70
Rcf2 70
Rhd2 70
a3+ 70
N7g6 69
Nac2 69
R5c7 69
Rac4 69
Rgc1 69
d2+ 69
exd2 69
Ng1+ 68
Nxa7+ 68
R1d6 68
R6d4 68
Reb2 68
Red5 68
Rhd3 68
e1=Q+ 68
Bxc2+ 67
N4b3 67
Nfd6 67
R1d5 67
R5d7 67
Raa3 67
Rbb3 67
Rce6 67
Rdc4 67
Rgd3 67
b1=Q+ 67
cxd6+ 67
Nfxd7 66
Rexd1 66
N6h7 65
Nfe1 65
Nhg5 65
R4f2 65
R5e7 65
Rcd4 65
Rff4 65
Ba2+ 64
Bxh4+ 64
Nce1 64
Nhf1 64
R2d3 64
R5c3 64
Rae3 64
Reh1 64
Rgf6 64
Rhg2 64
N5c6 63
Nbc8 63
Nfh5 63
Rad1+ 63
Raf2 63
Rdxd4 63
Rdxd5 63
Rge7 63
Rhf3 63
Bxb6+ 62
Na2+ 62
Rbd6 62
Rcd5 62
Rexe6 62
Rfd4 62
Rhg7+ 62
c2+ 62
cxb2+ 62
Kxa1 61
Nbc1 61
Nbxd6 61
Nxb4+ 61
Nxb7+ 61
R1f3 61
Rad3 61
Rde4 61
Rexe7 61
Rfe1+ 61
Rfe5 61
Rgf2 61
Rgh1 61
Rhg7 61
h8=Q+ 61
Na7+ 60
Ngxe2 60
R1b3 60
R5c2 60
R8d5 60
Rbe2 60
Rbxb7 60
Rca7 60
Rec6 60
Rfg7 60
Rfxc1 60
Rge6 60
Nb1+ 59
Ncd8 59
R4e3 59
R6a7 59
Raa5 59
Raxa7 59
Rfe4 59
dxe3+ 59
N6d5 58
Neg3 58
R1g2 58
R5f7 58
Rdg2 58
Rfb2 58
bxc2+ 58
R4c5 57
Rdf6 57
R4c6 56
R8d4 56
Rbb4 56
Rcb3 56
Rha8 56
bxc6+ 56
Nexc5 55
Nge8 55
Nxd8+ 55
Rbd5 55
Rfg2 55
Rgg2 55
N4c3 54
Nbc7 54
Nec8 54
Qxh1+ 54
Rbxb2 54
Rea7 54
cxb6+ 54
g2+ 54
Bxf8+ 53
R8c5 53
Rab4 53
Rbc4 53
Rbd4 53
Rcxc4 53
Rgh8 53
N3e4 52
N6h5 52
Nab8 52
Ncb3 52
R2c3 52
R5d4 52
R5d6 52
Rab5 52
Rbb5 52
Rbh1 52
Reh8 52
bxa5+ 52
gxh2 52
Nab3 51
R1c5 51
Rcb6 51
Rhg3 51
bxa2+ 51
exf8=Q+ 51
Nb8+ 50
Ndxf6 50
R1c6 50
R3b2 50
R6b7 50
R8f6 50
Raa4 50
Rbc5 50
Rde5 50
Rexd5 50
Rff5 50
Rgb1 50
f1=Q+ 50
Bxc7+ 49
Nba5 49
Ncxe7 49
Nfg8 49
R6d3 49
R7c6 49
R8b6 49
Rad4 49
Rba3 49
Rbe3 49
Rcxc5 49
Rcxc7 49
Ref6 49
Rfxf6 49
Rhg4 49
Rhh2 49
Bb8+ 48
N1a2 48
Nca4 48
R1a3 48
R5e2 48
R5e6 48
R7d6 48
Rba2 48
Rba6 48
Rbf2 48
Rca3 48
Rcb4 48
Rcxc3 48
Rdc5 48
Rexe5 48
Rhf4 48
bxa3+ 48
Bb1+ 47
Nhf7 47
Nxa3+ 47
R8g7 47
Rda2 47
Rea2 47
Rec4 47
Rfxe1 47
Rfxf2 47
Rhe1+ 47
dxc3+ 47
N3h4 46
Ndc7 46
Ndxe6 46
Nhg6 46
Nhg7 46
Nxf1+ 46
R1e4 46
Rda7 46
Rdb3 46
Rexe4 46
Ncxd6 45
Ndf7 45
Nexf6 45
Ngxe7 45
Qg7# 45
R5c6 45
R6d5 45
Rad6 45
Rca2 45
Rce4 45
Rdxd3 45
Rfg3 45
R4f3 44
Raxa6 44
Rgb8 44
cxb3+ 44
N4c6 43
Nfxg4 43
R5f6 43
Rca5 43
Rch8 43
Rexc8 43
Rfd5 43
Rgf4 43
a1=Q+ 43
g1=Q+ 43
Bxa2+ 42
Bxa4+ 42
N6e5 42
Nec1 42
Nexg5 42
Nfg3 42
Nxe1+ 42
R2e3 42
R4e7 42
R8e5 42
Rae6 42
Rbh8 42
Rce5 42
Rge4 42
Rgh3 42
Rhf7 42
Rhg1+ 42
Bxa6+ 41
Bxb3+ 41
Ncb1 41
Ngh5 41
Nxa6+ 41
R3d4 41
R4c7 41
R5e4 41
Raxe8 41
Rbe6 41
Rexe3 41
Rfh1 41
Rgd7 41
Nbc2 40
Nh8+ 40
R1f4 40
R5c4 40
R7c5 40
Rbxc1 40
Rdh2 40
Rfg6 40
Rgg3 40
bxa4+ 40
Nba3 39
Nbxc5 39
Nca6 39
Nec2 39
Nexg4 39
Nfd1 39
R1xd4 39
R4c3 39
R4d6 39
R4e5 39
R7d5 39
Raxa5 39
Rca6 39
Rcb5 39
Rcxc2 39
Rcxc6 39
Rgh2 39
a2+ 39
axb2+ 39
N5e4 38
Ncxe2 38
Nexc4 38
Nfxg5 38
Nhf2 38
Nxa5+ 38
R1a6 38
R1e5 38
Rca4 38
Rgd2 38
Rgg6 38
Rhf5 38
Rhg6 38
dxe7+ 38
Nab7 37
R4b7 37
R4f5 37
Rcxd1 37
Ref4 37
Rfd1+ 37
Rgc7 37
Rhe3 37
cxd7+ 37
Ndc2 36
Nfxe6 36
Nxa4+ 36
R4f7 36
Rac8+ 36
Rcxd6 36
Rdb5 36
Rdb6 36
Rdf4 36
Reg3 36
Rfh8 36
Rge2 36
b7+ 36
N4e5 35
N6a5 35
Ndf2 35
Ngxf6 35
R2d4 35
Rad5 35
Rdxd2 35
Rexd4 35
Rfa7 35
Rhe7 35
fxe7+ 35
N7xf6 34
R1e6 34
R2a3 34
R2c4 34
R3d5 34
R4b6 34
R8c3 34
Rbxb5 34
Rbxb6 34
Rgd4 34
Rge5 34
Rgxg7 34
Rhd4 34
a7+ 34
N6xd5 33
Naxb5 33
Ncxb4 33
Nfd8 33
R8d3 33
R8e4 33
Rbxd8 33
Reg7 33
Rexd6 33
Rhh3 33
h1=Q+ 33
N6e7 32
N8c7 32
Nab2 32
Nef8 32
Nhxf6 32
Nxc1+ 32
R1a5 32
R1g3 32
R6c5 32
R6g7 32
R7b6 32
R8c4 32
R8h7 32
Raxb1 32
Rcxd5 32
Rdxc4 32
Rdxc8 32
Reb3 32
Reg2 32
Rexe2 32
Rfe8+ 32
Rfxf4 32
Rfxf5 32
Rgd6 32
Rhe5 32
Rhf6 32
Kd6+ 31
Nexd6 31
Nxb2+ 31
R2e4 31
R4d7 31
Rag7+ 31
Raxa2 31
Raxa4 31
Rba5 31
Rbxb4 31
Rcg7 31
Rcxd4 31
Rcxd8 31
Rea3 31
Rec5 31
Rfa2 31
Rhh6 31
axb7+ 31
R1h2 30
R2b3 30
R2c6 30
R2d5 30
R3c7 30
R5f3 30
R7c3 30
R7e5 30
R8a6 30
Rbxb3 30
Rdb4 30
Rdxe4 30
Rfc3 30
Rgc2 30
Rgh4 30
Rhxf8 30
cxb7+ 30
cxd3+ 30
exd3+ 30
exd8=Q+ 30
Ke3+ 29
N3c4 29
N3e2 29
Nbxc4 29
Nexf4 29
Ngxe6 29
R3g2 29
R4d5 29
R4e6 29
R4f6 29
Rdxe5 29
Rexd3 29
Rfb3 29
Rfxf3 29
Rgd5 29
Rgf5 29
Rgg4 29
Rgg5 29
Rhe4 29
Rhf2 29
Kf3+ 28
N5a4 28
N5g6 28
Nac1 28
Nca5 28
Nef6+ 28
Nxd1+ 28
R1h3 28
R2d6 28
R8a3 28
R8e3 28
Rdg3 28
Rdxc5 28
Reb6 28
Rga8 28
Rgh7 28
Rhg2+ 28
Rhg5 28
Rhg8+ 28
Bxf1+ 27
Kd4+ 27
Ke5+ 27
N4a5 27
N6g5 27
N8g6 27
R1d7 27
R3a4 27
R4a3 27
R5a7 27
R5f2 27
R6c4 27
Rdxe6 27
Rgxg7+ 27
Rhd5 27
Rhd7 27
Rhe6 27
dxc8=Q 27
Bxa5+ 26
Nef7 26
Nhxf4 26
R1c7 26
R3a2 26
R3d7 26
R4a2 26
R4b5 26
R5a6 26
R5b6 26
R7a6 26
Rcg7+ 26
Rda5 26
Reb4 26
Ref5 26
Rfg4 26
dxe8=Q+ 26
N3a4 25
N4c5 25
N7a6 25
Ndxf5 25
Qh8# 25
R5a4 25
R7e3 25
Rae1+ 25
Raf3 25
Rbe5 25
Rdf5 25
Rdxc3 25
Reg4 25
Rga1 25
Rgh6 25
Bxd8+ 24
Kf6+ 24
N7e6 24
N8a7 24
Ncxe6 24
Nde8 24
Ndxf4 24
Nexd2 24
Ngf7 24
Ngh7 24
Nh1+ 24
Nhg3 24
Qxg7# 24
R1b4 24
R2c5 24
R3c4 24
R3c5 24
R5b3 24
R5b7 24
R7f6 24
R8a5 24
R8b5 24
Rac1+ 24
Rae4 24
Rgh5 24
Rhc7 24
Bxa3+ 23
Kc4+ 23
Kd3+ 23
Ke6+ 23
N1c2 23
N1d3 23
N6c5 23
N8f6 23
Naxc6 23
Ndxe7 23
Neg7 23
Nexf5 23
O-O+ 23
R1a4 23
R1b6 23
R3d6 23
R3e4 23
R5a3 23
R5b2 23
R5f4 23
R7d3 23
R7e6 23
R8d2 23
Rae5 23
Raxd6 23
Raxe1 23
Rcf3 23
Rda4 23
Reg6 23
Rexf5 23
Rfd8+ 23
Rfh3 23
Rhe2 23
N5e6 22
Na8+ 22
Ndb7 22
Ndxf3 22
R3e6 22
R3f7 22
R7c4 22
R8f5 22
Rba4 22
Rbg7+ 22
Rbxc6 22
Rbxd4 22
Rcxe4 22
Rfxe5 22
Rgxg2 22
Rhd6 22
b2+ 22
bxa1=Q 22
dxc2+ 22
gxf8=Q+ 22
Ke4+ 21
Kf4+ 21
N3g4 21
N4xd5 21
N7c5 21
Nac8 21
Ned1 21
Ned6+ 21
Ned8 21
Nfxd6 21
R3e5 21
R3e7 21
R5a2 21
R6f5 21
R8b3 21
Rae8+ 21
Rag2 21
Rbe4 21
Rbxd6 21
Rde1+ 21
Rdxc1 21
Rfb6 21
Rfc6 21
Rfg5 21
Rhe8+ 21
N3d5 20
N3xd4 20
N4g3 20
N5c4 20
N7e5 20
N8a6 20
Na1+ 20
Ndb2 20
Ndxb4 20
Ndxe2 20
Nexf7 20
Ngh6 20
Ngxf2 20
Ngxf5 20
Qf8# 20
R2f3 20
R3b6 20
R7a5 20
R7d4 20
R7f5 20
Raxa3 20
Rcf6 20
Reg5 20
Rfc4 20
Rfxe4 20
Rfxe6 20
Rhc5 20
Bxe8+ 19
Kc6+ 19
N6c4 19
N7d5 19
Nca3 19
Ndf6+ 19
Neg1 19
Nexc6 19
Nhg8 19
R1b7 19
R1h7+ 19
R1xd5 19
R2b7 19
R2c7 19
R2d7 19
R5g7 19
R6b2 19
R6e3 19
R7d2 19
Raxb4 19
Raxb5 19
Raxb6 19
Rcf4 19
Rcg2 19
Rda3 19
Rdxe3 19
Rea5 19
Rfc8+ 19
Rhc2 19
Rhc3 19
Rhh4 19
Rhh5 19
Rhxh7 19
bxa6+ 19
Bxa7+ 18
Kc7+ 18
N3xe4 18
N4xe5 18
Nde1 18
Nexc3 18
Nfh4 18
Nhf5+ 18
Qg8# 18
R1b5 18
R1xc4 18
R1xe4 18
R2xc3 18
R3b4 18
R3b7 18
R4a6 18
R4b2 18
R4b3 18
R5g3 18
R6b4 18
R6e5 18
R7b5 18
R7e4 18
R8b4 18
Raf6 18
Rag7 18
Raxc5 18
Rbf3 18
Rbf6 18
Rbxc5 18
Rdg7+ 18
Rdxc7 18
Rdxe7 18
Rdxf7 18
Rexc1 18
Rfh2 18
Rfxb8 18
Rfxd6 18
Rfxf7+ 18
Rg8# 18
Rgc6 18
Rh8# 18
Kf5+ 17
N2e3 17
N4f5 17
N5xd4 17
Naxb4 17
Nbxa5 17
Ncxb6 17
Ncxd7 17
Nef5+ 17
Ngf2 17
Nhg2 17
R1d7+ 17
R1xd2 17
R2b4 17
R2b6 17
R3a7 17
R5b4 17
R6b5 17
R6c3 17
R6e2 17
R6e4 17
R6f4 17
R6xd5 17
Rcxd3 17
Rea6 17
Rexd7 17
Rfa3 17
Rfg7+ 17
Rgb7 17
Rgf2+ 17
Rgf7+ 17
Rhb2 17
bxa7+ 17
bxa8=Q 17
dxc7+ 17
... 16
Kd5+ 16
N1f2 16
N2e4 16
N4a6 16
N4h5 16
N6f5 16
N6xe5 16
Naxc3 16
Nbd6+ 16
Nbxa4 16
Ncxd3 16
Nef1 16
Nfxe3 16
Nhxf5 16
Nxg8+ 16
R2e6 16
R2e7 16
R3f4 16
R4a7 16
R4h3 16
R6b3 16
R7c2 16
R8a4 16
Rag8+ 16
Raxc3 16
Rbg2 16
Rbxa5 16
Rcxb4 16
Rd8# 16
Rda6 16
Reb5 16
Rfxd4 16
Rfxe7 16
Rhf1+ 16
bxc8=Q+ 16
cxb8=Q 16
cxd2+ 16
cxd8=Q+ 16
exd8=Q 16
Bxe1+ 15
Kc5+ 15
N3c5 15
N4g5 15
N8d6 15
N8e6 15
Ncxa4 15
Ngh4 15
Ngxf7 15
Qe7# 15
Qf6# 15
Qh5# 15
R1f7+ 15
R1h4 15
R1h5 15
R1xc3 15
R2b5 15
R3a5 15
R5g2 15
R6c2 15
R8c2 15
R8xd5 15
Raxc7 15
Rbg7 15
Rbxc4 15
Rbxd1 15
Rcf5 15
Rcxa4 15
Rcxd2 15
Rcxd7 15
Rdg4 15
Rdxc6 15
Rdxd7+ 15
Reh4 15
Rexe6+ 15
Rfc5 15
Rfh5 15
Rfxd7 15
Rgc3 15
dxc8=Q+ 15
exd2+ 15
fxe8=Q 15
Kf8+ 14
N1e3 14
N4f6 14
Ndxc6 14
Nexd7 14
Nfh7 14
Ngh2 14
Ngxf4 14
Qe8# 14
R1a7 14
R1e7 14
R1xc2 14
R1xd3 14
R2a4 14
R4g5 14
R6a5 14
R8a2 14
R8f7+ 14
Rad8+ 14
Raxa8 14
Raxd5 14
Raxd7 14
Rbxd5 14
Rcg2+ 14
Rcxe5 14
Rcxe6 14
Rdf1+ 14
Rdg7 14
Rdh5 14
Red1+ 14
Reh3 14
Rexc4 14
Rexd2 14
Rexf7 14
Rfh4 14
Rfxc7 14
Rfxd5 14
Rgxf6 14
Rhc4 14
dxe8=Q 14
fxe8=Q+ 14
Bxg8+ 13
N4b5 13
N5b4 13
Nba7 13
Ncd6+ 13
Ndc8 13
Ndxe3 13
Nge1 13
Ngf6+ 13
Qd8# 13
Qh7# 13
Qxh7# 13
R1f6 13
R1xc5 13
R2f6 13
R3c6 13
R3f6 13
R4g6 13
R5xd4 13
R6f2 13
R8d2+ 13
R8e2+ 13
Rag2+ 13
Rag3 13
Raxb3 13
Raxe4 13
Raxf8 13
Rbf4 13
Rbg2+ 13
Rcxb5 13
Rcxc8 13
Rdh7 13
Rexf4 13
Rgb2 13
Rhxc8 13
cxd8=Q 13
exf1=Q+ 13
hxg8=Q+ 13
Kf7+ 12
Kg3+ 12
Kg4+ 12
N2d3 12
N2d4 12
N2f4 12
N5xf6 12
N6c7 12
N7d6 12
N8f7 12
N8g7 12
Naxb3 12
Nbc7+ 12
Nbxc6 12
Nbxd3 12
Nce4+ 12
Nce6+ 12
Ncxe3 12
Ndxb3 12
Ndxb6 12
Ndxf2 12
Nfg1 12
Nfg7 12
Qe6# 12
R1xe2 12
R1xe3 12
R2a6 12
R2f4 12
R3g7 12
R4a5 12
R4g2 12
R6f3 12
R6xc5 12
R7a2 12
R7f4 12
R8f4 12
R8g6 12
R8xb5 12
R8xd6 12
R8xe7 12
Rah2 12
Raxd4 12
Rbxa4 12
Rbxa6 12
Rbxc3 12
Rbxe3 12
Rbxe4 12
Rbxe5 12
Rbxf7 12
Rcxb6 12
Rcxc1 12
Rdc8+ 12
Rdh3 12
Rdxf2 12
Rexc6 12
Rfh6 12
Rga3 12
Rgb3 12
Rgc4 12
Rgxg5 12
Rh7# 12
Rhc8+ 12
Rhxh4 12
e8=N+ 12
Bxb8+ 11
Bxd1+ 11
Ke7+ 11
Kf2+ 11
Kg5+ 11
N1xd2 11
N2g4 11
N3f4 11
N5f4 11
N6b5 11
Nbd8 11
Nbxc3 11
Nca7 11
Nde5+ 11
Ndf3+ 11
Ndf5+ 11
Neg2 11
Nfh6 11
Ngh3 11
R1e7+ 11
R1xc6 11
R2e5 11
R5h4 11
R6a2 11
R6h7 11
R6xd4 11
R7a3 11
R7a4 11
R7b2 11
R7b3 11
R7f3 11
R7g6 11
R8h6 11
R8xb7 11
Raf7+ 11
Raxc4 11
Raxe7 11
Rbxc2 11
Rcg3 11
Rcxb7 11
Rcxe3 11
Rcxe7 11
Rcxf2 11
Rdxd8 11
Rdxf1 11
Rdxf3 11
Rdxf4 11
Rea4 11
Rfb4 11
Rfxe3 11
Rgxf1 11
Rgxf8 11
Rhxg4 11
bxc1=Q+ 11
dxe1=Q+ 11
Bxc1+ 10
Kc3+ 10
Kf1+ 10
N3e5 10
N4d6 10
N5xe4 10
N6xc5 10
Naxb6 10
Nbd1 10
Nbxa6 10
Ncb2 10
Nde7+ 10
Ndxf7 10
Nef2 10
Neg5+ 10
Nfd3+ 10
Nfd6+ 10
Nfg5+ 10
Nfxe8 10
Ngf3+ 10
Nhxg4 10
Nhxg5 10
Nxh1+ 10
Qg2# 10
Qh4# 10
Qxg2# 10
R1b2+ 10
R1d2+ 10
R1f2+ 10
R1f5 10
R1g2+ 10
R1h2+ 10
R1xf2 10
R2a5 10
R3b5 10
R4xd5 10
R5h2 10
R5h6 10
R6a4 10
R6g3 10
R6g5 10
R7e2 10
R7f2 10
R8d7+ 10
R8e3+ 10
R8h5 10
R8xc5 10
R8xc7 10
Raxb7 10
Raxc6 10
Raxe5 10
Raxf1 10
Rbxa2 10
Rbxe7 10
Rcg6 10
Rch2 10
Rch3 10
Rcxa5 10
Rcxb3 10
Rcxf3 10
Rcxf5 10
Rdg1+ 10
Rdxb3 10
Rdxf5 10
Rdxf6 10
Re8# 10
Ref7+ 10
Rexf2 10
Rf8# 10
Rfh7 10
Rfxb1 10
Rfxf2+ 10
Rgxf4 10
Rgxg4 10
Rgxg6 10
Rgxg6+ 10
Rhxd4 10
Rhxd8 10
Rhxf5 10
fxe2+ 10
gxf1=Q+ 10
Kd7+ 9
Ke1+ 9
N3a2 9
N6a7 9
N6xd7 9
N7b5 9
Nba2 9
Ncb7 9
Nef3+ 9
Nexf2 9
Nexf6+ 9
Nexg6 9
Nf7# 9
Nfe5+ 9
Ngxe3 9
Nhxf3 9
Nxb8+ 9
Qc8# 9
Qd7# 9
Qf7# 9
Qg5# 9
Qh6# 9
R1c6+ 9
R1h6 9
R1h7 9
R1xa2 9
R1xe6 9
R2f5 9
R3xc4 9
R4g3 9
R4g7 9
R5g6 9
R5h7 9
R6h3 9
R6h4 9
R7d6+ 9
R7h6 9
R7xc6 9
R8h4 9
R8xa7 9
R8xc6 9
R8xd4 9
R8xe6 9
Rag1+ 9
Raxd3 9
Raxe2 9
Raxf2 9
Raxf7 9
Rbh2 9
Rbxc7 9
Rbxe2 9
Rbxe8 9
Rcxa6 9
Rcxe1 9
Rdh6 9
Rdxa5 9
Rdxe2 9
Red2+ 9
Rexc3 9
Rexc7 9
Rexe8 9
Rexf3 9
Rf7# 9
Rfxd2 9
Rfxd3 9
Rfxf6+ 9
Rgxd6 9
Rgxg3 9
Rhf7+ 9
Rhxe1 9
Rhxe5 9
Rhxh3 9
bxc8=Q 9
cxb1=Q 9
dxc1=Q 9
dxe2+ 9
exd1=Q+ 9
Bxc8+ 8
Kb4+ 8
Ke2+ 8
Kg2+ 8
N2xf3 8
N4e6 8
N4g6 8
N5a6 8
N7xb6 8
Nbxc7 8
Nce7+ 8
Ncxb1 8
Ndc4+ 8
Ndc5+ 8
Nde6+ 8
Nexd3 8
Nexg7 8
Nfd5+ 8
Nfe4+ 8
Nfe7+ 8
Nfg6+ 8
Nfh2 8
Nfxe7 8
Ngxf3 8
Ngxh5 8
Nhf4+ 8
Nhf6+ 8
Nhxf2 8
Nhxf7 8
Nhxg3 8
Nxa8+ 8
Nxh8+ 8
Qb2# 8
Qf1# 8
Qg6# 8
Qh1# 8
R1c7+ 8
R1e2+ 8
R1g7+ 8
R1xd6 8
R2a7 8
R2h3 8
R3a6 8
R3g4 8
R4h2 8
R4xd3 8
R5g4 8
R6h5 8
R7b4 8
R7g5 8
R8b2 8
R8d3+ 8
R8e2 8
R8h3 8
R8xd7 8
R8xe5 8
R8xf7 8
Raf5 8
Raxb2 8
Raxe6 8
Rbc8+ 8
Rbf7+ 8
Rbxa3 8
Rbxa7 8
Rbxf2 8
Rcxa2 8
Rcxb8 8
Rde7+ 8
Rdf7+ 8
Rdg6 8
Rdh4 8
Rdxd1 8
Rdxe8 8
Rdxf8 8
Re1# 8
Reh2 8
Reh6 8
Reh7 8
Rexc2 8
Rexf6 8
Rexf8 8
Rfb5 8
Rfc1+ 8
Rfe7+ 8
Rga2 8
Rgxg3+ 8
Rh4# 8
Rhb7 8
Rhd8+ 8
Rhxf6 8
Rhxh2 8
Rhxh5 8
cxd1=Q+ 8
d8=N+ 8
exd1=Q 8
f8=N+ 8
Kg6+ 7
N1g3 7
N2xb3 7
N3xc4 7
N5xb6 7
N6g7 7
N7h6 7
N8b7 7
N8xe7 7
Nbc5+ 7
Ncd5+ 7
Nce3+ 7
Nce5+ 7
Ncxa5 7
Ncxb2 7
Ncxb3 7
Ndc6+ 7
Ndf7+ 7
Ndxc3 7
Ndxc8 7
Nec4+ 7
Neg4+ 7
Nexf3 7
Nexf3+ 7
Nf6# 7
Nfh3 7
Nfxg6 7
Nge3+ 7
Nge5+ 7
Nhg4+ 7
Nhxf6+ 7
Qe1# 7
Qh2# 7
Qxf7# 7
R1b7+ 7
R1g4 7
R1xa4 7
R1xb4 7
R1xe5 7
R1xf5 7
R4h5 7
R4xc5 7
R5xe4 7
R6g4 7
R6xb5 7
R6xc4 7
R7e6+ 7
R7g3 7
R7g6+ 7
R7xa6 7
R7xd6 7
R8a2+ 7
R8e7+ 7
R8g3 7
R8g4 7
R8h2+ 7
R8h7+ 7
R8xf6 7
Rb1# 7
Rb8# 7
Rbf5 7
Rbg8+ 7
Rbxd7 7
Rcxe8 7
Rdg8+ 7
Rdxa4 7
Rdxa6 7
Rdxb2 7
Rdxf7+ 7
Red8+ 7
Reg7+ 7
Rexb7 7
Rexc5 7
Rfa4 7
Rfa5 7
Rgxe6 7
Rh2# 7
Rh6# 7
Rhb3 7
Rhb4 7
Rhc6 7
Rhg3+ 7
Rhxd3 7
Rhxd5 7
Rhxd6 7
Rhxe4 7
Rhxe6 7
Rhxf7 7
bxc1=Q 7
exf8=Q 7
f1=N+ 7
fxg1=Q+ 7
fxg8=Q+ 7
Bxb1+ 6
Kb3+ 6
Kb6+ 6
Kh3+ 6
N1a3 6
N1g2 6
N2b4 6
N5a3 6
N6d4 6
N6e4 6
N7f5 6
N7g5 6
N7xe5 6
N8b6 6
N8xd7 6
Nbxc8 6
Nca8 6
Ncxb7 6
Ncxd1 6
Ncxd2 6
Ncxd5+ 6
Ndc1 6
Nde4+ 6
Ndxc7 6
Ndxe8 6
Ndxf6+ 6
Ned4+ 6
Nef4+ 6
Nef7+ 6
Nexc8 6
Nexg3 6
Nfg2 6
Nfxe2 6
Nfxg2 6
Nfxg3 6
Ngf5+ 6
Ngf7+ 6
Nhg3+ 6
Qc7# 6
Qg3# 6
Qg4# 6
Qh3# 6
R1a2+ 6
R1d6+ 6
R1e6+ 6
R1f7 6
R2d3+ 6
R2g4 6
R2xb3 6
R2xc5 6
R2xe4 6
R3xe2 6
R3xe4 6
R4f7+ 6
R4h6 6
R5xc4 6
R6e5+ 6
R6g2 6
R6h2 6
R6xe5 6
R7c6+ 6
R7g4 6
R7xa5 6
R7xc4 6
R7xd4 6
R7xe4 6
R8f2+ 6
R8g5 6
R8xa6 6
R8xb6 6
R8xe4 6
R8xg7 6
Rab8+ 6
Raf2+ 6
Rah3 6
Rah7 6
Raxc2 6
Raxe3 6
Rbh7 6
Rc8# 6
Rcd1+ 6
Rcd7+ 6
Rcg4 6
Rch7 6
Rcxb2 6
Rcxf4 6
Rd7# 6
Rde8+ 6
Rdxb4 6
Rdxb5 6
Rdxe1 6
Rdxg7 6
Ref2+ 6
Reh5 6
Rexa5 6
Rexb2 6
Rexb5 6
Rexe1 6
Rexe2+ 6
Rexg5 6
Rfxb7 6
Rfxc4 6
Rfxc6 6
Rfxf1 6
Rfxg5 6
Rgb5 6
Rgxe3 6
Rgxe5 6
Rgxe7 6
Rh1# 6
Rha5 6
Rhxe8 6
Rhxf4 6
a8=R 6
axb8=Q 6
bxc7+ 6
d8=Q# 6
dxc1=Q+ 6
e1=N+ 6
fxe1=Q+ 6
gxf8=Q 6
gxh8=Q 6
Bxg1+ 5
Kb5+ 5
Kb8+ 5
Kc2+ 5
Kc8+ 5
Kg7+ 5
Kh5+ 5
N1b3 5
N2xc3 5
N2xe4 5
N3b4 5
N3c2 5
N3g5 5
N4e3 5
N4xa5 5
N4xb5 5
N5d6 5
N5e3 5
N5g4 5
N5h4 5
N6b4 5
N6f5+ 5
N7f5+ 5
Nac5+ 5
Naxb2 5
Naxb7 5
Nbxa3 5
Nbxa7 5
Ncd3+ 5
Ncxd8 5
Ncxe8 5
Ndc7+ 5
Ndxc2 5
Nexd8 5
Nf5# 5
Nfd4+ 5
Nfg4+ 5
Nfxd8 5
Nfxh5 5
Nfxh6 5
Ng6# 5
Nge6+ 5
Nhg6+ 5
Nhxg6 5
Nhxg7 5
Qb3# 5
Qd5# 5
Qe4# 5
Qf2# 5
Qxf8# 5
Qxh2# 5
R1g5 5
R1xb2 5
R1xd7 5
R1xh4 5
R2b3+ 5
R2c3+ 5
R2d7+ 5
R2e3+ 5
R2f7 5
R2g3 5
R2g6 5
R2xa3 5
R2xb4 5
R2xb5 5
R2xc4 5
R2xd5 5
R2xe3 5
R2xf3 5
R3f5 5
R3g6 5
R3h5 5
R3h7 5
R3xc5 5
R3xc6 5
R4xb5 5
R4xc6 5
R5g6+ 5
R5h3 5
R5xf4 5
R6h7+ 5
R6xe7 5
R7a6+ 5
R7h4 5
R7h6+ 5
R7xe5 5
R7xe6 5
R7xf5 5
R7xf6 5
R8f3 5
R8g7+ 5
R8xf4 5
Rab1+ 5
Rab2+ 5
Raf4 5
Raxd2 5
Rbe2+ 5
Rbe7+ 5
Rbg1+ 5
Rbg4 5
Rbh3 5
Rbxb1 5
Rbxd3 5
Rbxe1 5
Rbxf6 5
Rc1# 5
Rcb8+ 5
Rce8+ 5
Rcf1+ 5
Rcf7+ 5
Rch4 5
Rcxa7 5
Rcxe2 5
Rcxf6 5
Rd1# 5
Rd2# 5
Rdg5 5
Rdxc2 5
Rdxh5 5
Re7# 5
Red7+ 5
Ref1+ 5
Reg3+ 5
Rexa4 5
Rexb3 5
Rexb4 5
Rexf1 5
Rexg2 5
Rexg4 5
Rfe6+ 5
Rfg2+ 5
Rfxb2 5
Rfxc2 5
Rfxc3 5
Rfxc5 5
Rfxf8 5
Rfxg4 5
Rfxh5 5
Rg4# 5
Rg6# 5
Rga6 5
Rga7 5
Rgb4 5
Rgc5 5
Rgd7+ 5
Rge1+ 5
Rge8+ 5
Rgf1+ 5
Rgf3+ 5
Rgf6+ 5
Rgxc4 5
Rgxd5 5
Rgxd8 5
Rgxf2 5
Rgxf5 5
Rgxf7 5
Rhg5+ 5
Rhxc3 5
Rhxg1 5
Rhxg5 5
Rhxg6 5
Rxh5# 5
Rxh6# 5
c8=N+ 5
e8=R+ 5
g1=N+ 5
gxf1=Q 5
hxg1=Q+ 5
