O-O 5549890
Nf6 3716007
Nf3 3634310
<end> 3561458
<start> 3561458
d4 3440384
e4 3252404
Nc3 3060162
d5 2873458
e5 2781788
c5 2739377
Nc6 2546253
c4 2513470
e6 2154561
g6 1938135
d6 1917984
f4 1876795
f5 1729502
b5 1728617
Be7 1683993
a6 1666349
Be3 1623569
b4 1575150
a4 1557460
a5 1526390
Bd3 1517919
g3 1497007
cxd4 1445793
h3 1436733
h6 1436485
Bg7 1431117
h4 1395924
h5 1378619
g4 1322176
c6 1305384
Bg5 1286580
Nxd4 1256420
a3 1247592
g5 1241980
Qc7 1241902
Be2 1240151
Ne5 1218069
b6 1198607
c3 1190346
Re1 1183316
Bd7 1165300
b3 1159832
Re8 1151012
exd5 1134457
Qd2 1131997
Nd7 1117756
Nd5 1114714
Ne4 1110172
f3 1035504
Qe2 1035335
Rc8 1006708
e3 997170
Be6 992141
cxd5 990347
Bg2 990010
Bb7 966234
f6 950588
Qc2 944559
Kg7 929795
Bc4 885314
Rc1 883403
Nd4 875038
Bf4 868138
Nd2 862847
Qe7 856390
dxe5 852401
Rd1 849165
Bd2 838592
Bd6 828728
Rd8 825326
Rb8 820631
Kg2 819636
Nbd7 817683
Nxd5 815641
Kf7 809694
Bg4 803121
Nxe4 800923
Kf2 795480
Nc5 777283
Nxe5 758356
Qd7 743472
Ke7 730022
d3 724341
Qb6 721017
Bf5 719855
Nc4 701280
Kf8 698826
Rb1 682693
Ne2 662299
Bb5 660831
Kh1 649193
Bxf6 646658
Kh8 640250
Ne7 635041
Ke2 630514
O-O-O 630326
Bc5 629548
Nb6 608447
Qd3 601965
Bb4 601372
Kf6 585829
Kf1 576645
Ke3 570006
Nf5 568969
Bb2 567222
Rd2 565478
Kh2 561462
exd4 561047
Kf3 559931
Nf4 551295
Qb3 546954
Qf3 545632
Qa5 541954
Bf6 539375
Rd7 538112
Kh7 537874
Kg8 521633
Rc7 514129
Bb3 509664
Ng5 506504
Ke6 506088
Ng4 501944
dxe4 499265
Rad1 492997
Bc6 492670
Ne3 492342
Nb3 490734
bxc3 480779
Qe3 479839
Bxf3 473250
Nd3 473067
Bf3 472997
Bd4 469348
Bxd5 466934
Nbd2 464992
axb5 464654
Qf6 463734
dxc5 460591
Ne6 457542
Kd7 456031
Re2 455590
Rf8 454416
Rc2 454325
Bxe4 451211
Qd6 450307
Kd3 445354
Re7 440518
Bxe5 439039
Kg1 438394
Kg3 437081
Ra8 435889
Ng3 431545
Rf1 423299
Nd6 423177
Bf8 422341
Kg6 422173
Kd2 421789
Kd6 420907
Bxc4 420667
Bxd4 416136
Nb5 414720
Qd8 414435
Be4 412891
fxe5 411084
Nh5 408506
dxc4 407023
Bd5 406152
axb4 402602
Rd3 396757
Ra1 395141
Bc2 393407
Bh6 392162
Na5 388226
Be5 384998
Nb4 379323
Ng6 376624
Bc3 374843
Qxd4 374578
Qxd5 374302
bxc6 371141
exf5 370912
Rg8 368228
Re3 360919
Rf7 359830
Ba6 359472
Qg4 357605
Rfd1 353852
Ra7 353339
Rad8 349838
fxe4 349670
Qh4 349219
Bxc6 348103
Ke4 347523
Ke5 345099
Bxc5 343043
Bh4 342155
Rac8 341692
Bf1 341404
Na4 337816
Rac1 336712
gxf5 336087
Rd6 335737
Bg3 335435
Qh5 333989
Rfe1 332658
Qc6 331813
Rf2 327882
Kf4 326940
Qg3 326344
Qf2 323556
Nc7 323035
Qg5 322751
hxg5 322508
Bxc3 321010
Kf5 320902
Nxc6 319199
Qd4 317780
Qf4 317449
Ne8 315966
Rg1 315837
Rb7 315649
Qc3 314239
Kd4 313678
Qe6 307600
Rfd8 305153
Bg6 304832
Rc3 304454
Nxc3 304347
Rd4 303472
hxg4 303337
Bb6 301737
Qe4 301422
Rc6 300212
Rf3 298903
Ra2 296210
Kc7 296001
Qa4 295969
Kd5 291463
Rc4 291301
Rfe8 290252
Na6 289465
Re6 288405
Nh4 287586
Qc5 285475
Bc8 284209
Rc5 283630
Bxf5 283479
Qd5 283333
bxc4 283140
Qe8 282683
Qc8 282384
Qe5 280903
Rd5 278100
Ke8 277452
Rxd5 273749
Kc6 273557
bxc5 272747
Rb2 272534
exf4 271568
Kc2 271205
Kb1 271100
Ra3 268981
Bf2 266828
Qd1 266735
fxe6 266617
Kc3 265612
Ba4 265064
Rb6 264211
hxg6 264111
Qf5 263900
Rxd4 263411
Nf8 262735
Rb3 262112
Qc4 261983
Bh3 259601
Qe1 259136
Qb7 258563
Rf6 256046
Bxf4 255440
Qb4 254928
gxf6 253836
Re4 253761
Kg5 253676
Qf7 253424
Rh8 252676
Nc2 252636
Nxc5 251751
Ra6 248643
gxf4 248257
Rxe5 248036
Re5 246987
Kg4 245959
Qxd6 243593
Qxe5 240031
Rb4 239383
Qxe4 239028
Ba3 238428
Qg6 238423
Rxe4 234378
Bc1 233300
Nxc4 232671
exf6 231934
Rh1 231076
Rxd8 229578
Kc5 228275
Ra4 227902
Nf1 227188
Bc7 226431
Kc4 224538
Bh5 224513
Qxd3 221820
Ra5 221409
cxb5 220425
Bxd6 219137
Rxd6 217319
Qxf6 216841
Ke1 215824
Qb5 213080
Rb5 212601
axb3 211235
Qc1 211067
Rae1 209822
Be8 209781
Kh6 209743
Na3 209601
Rg3 209332
Ne1 209197
Qxf3 207921
Nge2 207909
Kd8 207561
Rxd1 206122
Bxe7 205020
Rf4 204476
Qxc4 203233
Bd8 202835
Bxe6 202069
Qxe7 199795
Bxd3 198750
Rxc4 198048
Kxg7 197466
Qb8 195778
Kh3 195402
Rh3 193997
Rxc3 189055
Rf5 188591
Bxg5 188097
Qxc5 187414
gxf3 186714
Qb2 186224
Nxf6 186155
Qxc3 185643
Nxe6 182358
Rxc5 181419
Bxg7 180807
Qh3 180445
Rxe6 180123
Rae8 178856
Rfc8 176789
Rg7 175682
Nge7 175616
hxg3 174888
Rg6 174059
Bxb5 173763
Kb8 172760
Bf7 170792
Rxc8 170431
axb6 170270
fxg6 169304
Nxf4 167832
Nxd7 167324
Bd1 167011
Rxc6 166920
cxb4 166117
Qh6 165736
Nxf5 164529
Kb6 162875
Nf7 162853
Qa3 162606
Rxd7 162132
Qa6 162007
Rxb7 161902
Rxd3 161099
Nd1 160508
Rxc1 159275
Rab1 159211
dxc6 159173
Kd1 158680
Nf2 158665
Rxf4 158405
Rxf5 157948
Rxf6 157873
Nfd7 157338
Nxe3 156752
Rxb2 156631
Nh6 155808
Kb3 155413
Be1 154774
Rh4 154171
exd6 153819
Rxe3 152972
Rab8 152223
Kb2 151311
Rg2 150606
Rxd2 149823
Rh6 149560
Qxc6 149150
Kb7 147952
Bxg4 146600
fxe3 146157
Nxf6+ 145840
Rxe7 145730
fxg4 145265
gxh5 144858
Qxd7 144519
Rg4 144134
Bxe3 144018
Rfc1 143928
fxg5 143735
Nb8 143095
Qxf4 142368
Rh7 141941
Rxf7 141818
Bb1 141801
Ba5 141783
Nxd6 140628
Rxf3 140319
Rh5 139174
Rh2 136963
Kb5 135989
Qxe3 135571
Nxb5 135342
Rg5 134637
Kb4 134475
cxd6 133654
Bxe2 133641
Qxd2 133328
Rxc2 133027
Bb5+ 132493
Kxg2 132110
Nh3 131613
Nd8 131582
Rxa7 131557
Qxb2 131259
Qxf5 131237
bxa4 130880
Rxa2 130294
Rxe8 130201
Rxc7 129819
Nxd3 129628
Qg7 129500
Rxa4 128744
Qf8 128091
Rxa5 126946
Rxa6 126370
Bxg2 126297
Bxb4 125995
Kc8 125523
Qxb7 125507
Qxe2 125071
Bb4+ 124612
Qa7 124152
Qb1 122947
Rxb4 122645
Nxd2 122481
Qxe6 121950
Nxg5 121859
Kc1 121316
Rxe1 120220
Rxe2 119877
Nc8 119605
Bxa6 118138
Rxb5 117187
Qxg5 116976
Kh4 115893
Nc1 115162
Nh7 114744
Bxh6 113928
Kh5 113859
dxe6 113819
Rxf2 113121
Bxb7 112914
bxa5 112774
Bxc3+ 112763
Qxb4 112591
Qg2 111798
Qxb6 109575
Bxb2 109484
fxg3 108653
Bxd7 108424
Ng7 108423
Qxb5 108361
Nxg4 107545
gxh4 107524
Nh2 106481
Nxb3 105351
Nxf3 104817
Rxb6 104758
Kxf7 102927
Nxb4 102841
Qxg4 101502
Rxb3 101406
Re1+ 99562
Ngf6 98964
Qf1 98308
Rxa3 97940
Rd8+ 96102
cxd3 95586
Rd1+ 95401
Qd4+ 95324
Nxb6 95083
Rxa8 94764
Ng8 94499
Rxd8+ 94472
Nxg6 94113
Nxf3+ 93882
Qxb3 93821
Nb1 93271
Nf6+ 92440
dxc3 91676
Nb7 91556
Bxd2 90818
Rhe1 89934
Ba2 89636
Re8+ 89555
Qxd8 88667
Qa2 87843
Bxg6 87026
Rxd1+ 86927
Rxa1 86731
exf3 85975
Nxg3 85804
Qa8 85224
Qe5+ 82346
Qxc2 82116
Bxf8 81312
cxb3 81140
Qd5+ 80498
Qe4+ 80487
Bxb6 80331
Qxa5 80036
Qxa2 79726
Rxh5 79140
Nxe7 79136
Qa5+ 79082
Qxc7 77964
Qg5+ 77721
Nb2 77702
Rxe8+ 77286
Qh5+ 76793
Qxa4 76480
Bxh3 75859
Nxa4 75359
Red1 75188
Bxb3 74993
Ngf3 74855
Nxf7 74330
Rxf8 74006
Ba7 73866
Rxe1+ 73420
Qh4+ 72905
Rxh4 72672
Kxf2 72654
Rxg5 72430
Rc8+ 72018
Qxd1 71849
Rc1+ 71460
Ng2 71148
Bb8 71001
Qe6+ 70983
Qe3+ 70548
Qxa7 70103
Bxf1 70019
Qxa6 70013
Bxa4 69278
Qg4+ 68933
Rxg4 68728
Qc5+ 68517
Rxf1 67750
Qf4+ 67212
Rxh7 66912
Rxb8 66305
Bxg3 66125
Qxh6 66105
bxa6 66105
Rd7+ 65951
d7 65910
bxa3 65900
Nd6+ 65600
Qa4+ 65430
cxb6 65328
gxh6 65234
Qxh5 64634
Rxg7 64529
Nf3+ 64229
Red8 63839
Rxg6 63825
Rxf8+ 63418
Rc7+ 63227
Ka2 63118
Kxf8 63080
Nxa5 63032
Rxh6 63016
Bxd8 62844
Bh2 62356
Rd2+ 62152
Qa1 62075
Rxb1 62042
Nxh5 61830
Kxf6 61645
a7 61615
Ng1 61565
Bxc8 61219
Rde1 61167
Bh7 61080
Rf1+ 60913
Qxh4 60845
Qf5+ 60760
Nxe2 60439
Bd4+ 60180
Rc2+ 60139
Rcd1 59763
Bxa3 59760
Bxd7+ 59647
Qb6+ 59632
Re7+ 59355
Bxh4 58991
Rxg2 58374
Rxg3 58003
Rxf1+ 57949
Qf6+ 57595
Nxb7 57452
Kxf1 57372
Rf8+ 57212
Qe1+ 57203
Na7 57117
Ka7 57047
Qd8+ 56834
Qxg6 56592
Qxf7 56433
Na2 56266
Bg1 56218
Rg8+ 56139
Rg1+ 55967
Kxe7 55311
Qc4+ 54966
Rxh2 54872
Re2+ 54830
Rxh3 54651
Rfb8 54550
Nxb2 54533
Qd1+ 54392
Bxc2 54284
Nf5+ 54274
Qe8+ 54133
Rcd8 54068
Ne7+ 53929
Kxd8 53635
Ra7+ 53528
Ndb5 53230
Ne5+ 53197
Bxa5 53072
Qc1+ 52788
Ka1 52560
Rb8+ 52539
Ne4+ 52505
Bxh5 52495
Qxa3 52362
Kxf3 52274
c7 52106
Ka3 51973
Ba8 51938
Bxc1 51893
Bxd1 51762
b7 51586
Rhe8 51462
gxh3 51191
Rb1+ 51151
Rb7+ 51117
a2 51114
Ra2+ 51091
Ka6 51030
Bxf7+ 50996
Rf7+ 50965
Nxa6 50667
Nxe7+ 50456
Qxc8 50309
Rb2+ 50235
Qxg3 50206
Qg6+ 50081
Bxd2+ 49938
Bxc7 49899
Bc5+ 49822
Nxf2 49783
Qc8+ 49620
Qf3+ 49551
Qh6+ 49363
Qc3+ 49267
Nxc7 49251
Qxf2 49181
Nce2 49139
Rf2+ 48939
Nxh4 48921
Qe2+ 48876
Kxf4 48817
Qxg7 48695
Ka5 48660
Nxg7 48600
Qxd8+ 48563
Qe7+ 48414
Raf1 48293
Ndf6 48291
Nxc8 48057
Raf8 48000
Qg3+ 47974
d2 47831
Nd3+ 47771
Ka4 47754
Rhd1 47733
Qh2 47697
Nf4+ 47675
Rg7+ 47572
Bxa7 47487
Ne2+ 47386
Kxd7 47371
Qxe6+ 47343
Kxd2 47203
Kxf5 47087
Kxh7 47068
c2 46439
Qd3+ 46365
Qd6+ 46147
Rde8 45706
Rfb1 45516
Ra1+ 45505
Kxg5 45426
Nd5+ 45183
Ra8+ 44953
b2 44897
Qh8+ 44838
Kxe5 44785
Ne6+ 44693
Rg2+ 44686
Rxc8+ 44577
Ka8 44526
Qh7 44373
Qb1+ 44235
Qa1+ 44184
Qxe8 44115
Bxc6+ 44082
Kxe6 43689
Nbc6 43620
Rg3+ 43494
Bxa8 43303
Bxf7 43228
Nxc2 43222
Kxg6 43204
Kxg4 43068
Qb8+ 42944
Qc6+ 42845
e7 42768
Rh8+ 42579
Ng5+ 42493
Qc7+ 42301
Ra3+ 42090
Qxf7+ 41876
Bc4+ 41811
Bg8 41589
Kxe2 41476
Bxa2 41468
Kxe4 41270
Rd3+ 41122
Qc2+ 41060
Kxg3 40919
Rh7+ 40913
Qxh3 40842
Qb3+ 40739
Rd6+ 40705
Nd4+ 40670
Nxd8 40619
Rxc1+ 40592
Qxc1 39992
Rc3+ 39909
Ndf3 39897
Ne3+ 39816
Rh1+ 39422
Rf3+ 39343
Qf7+ 39146
Kxe3 38957
Qd2+ 38950
Rbc8 38903
Rhd8 38721
e2 38659
exd3 38579
Ra6+ 38532
Nxd1 38507
Qa8+ 38382
Qd7+ 38365
Bd5+ 38178
Nxg2 38177
Rhg1 38035
Rh2+ 38005
Qh7+ 37954
Re3+ 37852
Qxa8 37808
Rec8 37694
Qxe1 37665
Rf6+ 37515
Qh1+ 37491
Re6+ 37415
Rhf1 37411
Qg8 37258
Qh3+ 37150
Qxf2+ 36994
Bxf2 36947
Rxf7+ 36735
Rb3+ 36733
Rg6+ 36655
Nxf8 36503
h7 36482
Bxe8 35895
Qg1 35813
Rc6+ 35778
Qb7+ 35763
Kxd5 35637
Qxe5+ 35344
Kxh5 34957
Qxd4+ 34925
Rbc1 34877
Qf2+ 34866
Bxf2+ 34797
Qf8+ 34749
Qb4+ 34669
Qxg2 34585
Rbd1 34560
Ng4+ 34538
Nxe8 34534
Rb6+ 34499
Kxh6 34494
Qb2+ 34465
Kxh4 34429
Rbd8 34368
Nxe2+ 34294
Qxd5+ 33978
Qf1+ 33949
Kxd1 33922
Nfd2 33838
Rg4+ 33796
Kxd6 33791
Qxd1+ 33773
Rxg7+ 33617
Nde2 33547
Nxa3 33513
Bxa1 33511
dxe3 33473
Ba1 33327
Rec1 33169
Bxd4+ 33037
Rg5+ 32837
Nxc1 32809
Qxg6+ 32696
Rdc1 32462
f4+ 32461
Qb5+ 32338
Rhg8 32311
Rf4+ 32307
Qxe3+ 32185
Kxd4 32163
Kxh2 32119
Bxh7+ 31930
Nxa7 31841
Rxh8 31698
Rh3+ 31684
h2 31664
f5+ 31624
Rdc8 31328
Bh8 31277
Rxg2+ 30709
Qxe4+ 30642
Re4+ 30637
g5+ 30558
Nce7 30524
Rf5+ 30502
Bxe1 30492
Kxc4 30310
Qg8+ 30130
Nf7+ 30033
Qxd2+ 30012
Rxh1 30002
Qg1+ 29735
Qxh7 29663
Re5+ 29590
Qxa1 29436
Nbd5 29400
Kxd3 29325
Nc5+ 29160
Rh6+ 29160
Kxh3 29120
Bxe6+ 28966
Kxc5 28935
g4+ 28801
Nc4+ 28553
Nxa8 28404
Qxf8 28160
Rhf8 28144
Nce4 27948
Nxa2 27886
Nxf1 27777
Rxf2+ 27672
Nh6+ 27639
Qh2+ 27559
Be6+ 27384
Rdg1 27222
Qxf6+ 27181
f7 27104
Nxh7 27044
f2 27034
Rd4+ 27031
Nxh6 26988
Nxe1 26836
Rdf1 26797
g7 26722
Bxe3+ 26665
Be3+ 26564
Nf2+ 26521
Qa7+ 26419
Be5+ 25970
Qh8 25781
Rce8 25634
Rd5+ 25511
Nbc3 25473
Rce1 25321
Qg7+ 25165
Bg5+ 25136
Kxb4 24878
Qxg7+ 24872
Kxc3 24830
Rc4+ 24528
Bxd5+ 24503
Ng6+ 24300
g2 24116
Ra4+ 24014
Kxc6 23755
Kxb5 23691
Ra5+ 23689
Kxe8 23395
Rxg6+ 23390
Rc5+ 23380
Be4+ 23328
Bxb8 23240
Qg2+ 23146
Nxd3+ 23113
Nc6+ 23099
f6+ 23068
Ng3+ 23046
Qxg3+ 23004
Rxe7+ 22968
Qxg5+ 22731
Qxf3+ 22692
Rb4+ 22487
Qxe7+ 22454
Bf4+ 22372
Qh1 22372
Rbe8 22299
Rxg8 22297
Rbe1 22188
Qxb8 22186
Nxd6+ 22109
Rdd1 22077
Bf5+ 22000
Rdf8 21924
Nc3+ 21881
Bh6+ 21729
Nfd5 21661
Qxf1 21647
Qxe2+ 21641
Rb5+ 21474
Kxc7 21395
Bxb1 21195
Rhc8 21138
Nbd4 21084
Rdg8 21021
Kxc2 20978
Qxh7+ 20974
Nce5 20961
Qxg2+ 20838
Nh3+ 20505
Rxd7+ 20493
Nxh3 20364
e5+ 20314
Kxe1 20300
Nd7+ 20234
Kxb2 20208
Bxh7 20091
Nc7+ 20013
Bh1 19953
Rh4+ 19896
Qxc3+ 19782
Rh5+ 19664
Ree1 19662
Nde5 19661
h4+ 19595
exf7+ 19403
Nd2+ 19354
Rxg1 19282
Qxc5+ 19268
e4+ 19263
Qa2+ 19207
Qa3+ 19207
Qxh2 19190
Kxb7 19099
Bxg7+ 18969
f3+ 18969
Qxg4+ 18958
Rcc8 18952
Qxd7+ 18927
Na8 18902
Kxa5 18786
Rxg3+ 18776
h5+ 18703
Qxh6+ 18661
Bxh2+ 18579
Nec6 18513
Kxa4 18467
Qxf4+ 18384
Rxe6+ 18232
Rxe2+ 18227
Rdd8 18175
Bd6+ 18127
hxg5+ 18126
Nge5 17939
Ree8 17850
Ned7 17803
Rxh7+ 17778
Qxf5+ 17754
fxg7 17745
Nxe6+ 17691
Kxb6 17679
Kxb3 17639
Nge4 17639
Kxg8 17632
Nfd4 17522
hxg4+ 17372
Bd3+ 17323
Nhf6 17154
Nxh2 17007
Nxa1 16988
Qxb1 16948
Rhc1 16902
Bg4+ 16875
Bh4+ 16776
Nh5+ 16722
exf6+ 16603
Bxf6+ 16397
c4+ 16376
Nde4 16266
Qa6+ 16183
Rfa1 16134
Rxc2+ 15998
e6+ 15948
c5+ 15693
Rdd7 15533
Qxe8+ 15521
Bxh2 15450
Qxf8+ 15437
Qxc6+ 15335
Nxb8 15258
N8d7 15225
Reb8 15171
Rxf6+ 15134
Rxd2+ 15129
Bxg2+ 15113
a8=Q 15067
Raa8 15007
gxf4+ 15005
Rdd2 14962
Rxe5+ 14867
Qxe1+ 14830
Rag8 14812
Rxg5+ 14803
Rcc1 14779
d6+ 14611
gxf5+ 14606
Reb1 14582
Ncd5 14564
Nc2+ 14551
Rxf3+ 14511
Rxg4+ 14424
Rfa8 14341
hxg6+ 14340
Rxb2+ 14308
Qxh3+ 14267
Kxg1 14158
Qxh2+ 14133
Bh5+ 14116
Bh7+ 14053
Rcc7 14033
Nh4+ 14010
e3+ 13995
Ncd7 13992
Bc6+ 13866
Qxh5+ 13818
Bf6+ 13799
h6+ 13745
Bxh8 13711
Qxc4+ 13711
Ree7 13689
Rxh6+ 13631
Kxa6 13606
Nec3 13592
Rxh2+ 13561
Bc3+ 13542
Rxf4+ 13497
Rxb7+ 13391
Kxa3 13379
Rxc7+ 13371
R1d2 13292
a1=Q 13256
Ned4 13224
Ndxe5 13216
Ree2 13125
Rxf5+ 13121
Raa1 13112
Nxf5+ 13100
Nxh6+ 13097
d4+ 13076
Red2 12980
Nfe5 12977
Nxe5+ 12891
Bg6+ 12867
Ngxe5 12853
Rff8 12846
Bxe5+ 12787
Rag1 12767
Ref1 12696
Ned5 12637
Bh3+ 12615
Nfe4 12588
Nbxd4 12568
Bxf3+ 12525
Rxe4+ 12484
Rxd6+ 12459
g6+ 12422
Qxf1+ 12397
Qxh4+ 12382
N7f6 12379
Rbb8 12331
Nh8 12329
Nef6 12322
Rxh3+ 12305
Rff1 12277
b8=Q 12234
g3+ 12234
Bxc5+ 12190
Rcc2 12160
Rxg8+ 12068
Nbxd2 12057
Nb5+ 11976
Nh1 11957
Rxe3+ 11946
Nxb1 11863
Bxb5+ 11786
Bb6+ 11766
Bxe4+ 11750
hxg3+ 11736
Nb4+ 11727
Nfxd5 11675
Qxd6+ 11672
Rxc3+ 11641
Bf3+ 11556
Nxe4+ 11535
Ncxe5 11517
Nce3 11481
Ne8+ 11471
Qxb2+ 11468
Ref8 11450
Nxh3+ 11386
N6d7 11327
d3+ 11281
Qxc8+ 11254
Qxc2+ 11232
fxe5+ 11187
Nxg6+ 11105
Bb3+ 11068
Na1 11033
b1=Q 11022
Qxh8 10976
gxf6+ 10862
dxe7 10858
c8=Q 10821
N1c3 10791
Rcb8 10782
Nbxd5 10757
Qxb7+ 10748
Nxf7+ 10722
Ncxe4 10713
Rxd5+ 10664
Kxh8 10657
Nxf4+ 10657
d5+ 10635
Kxa2 10568
Nb6+ 10519
Ndc5 10497
Nxd5+ 10468
Bxh1 10404
Nxe3+ 10358
Bxg6+ 10332
b4+ 10324
Qxc1+ 10319
Rdh1 10312
Rxb8+ 10289
b5+ 10248
fxg6+ 10223
cxb2 10147
Neg5 10056
Nxh8 10041
Rxg1+ 10041
Rcf8 9955
Rde2 9925
Rxb1+ 9912
Rxc6+ 9908
Rbb1 9875
Rcd2 9862
h3+ 9828
Ba4+ 9804
Qxc7+ 9793
Kxc8 9787
Nb3+ 9669
c1=Q 9609
d8=Q 9609
Nxb3+ 9489
gxf7+ 9473
Kxa7 9433
Bh2+ 9392
Rxh5+ 9380
Rdb8 9378
Rxd3+ 9356
Ba6+ 9335
fxe4+ 9247
Rxd4+ 9230
Bxf4+ 9219
Bxc4+ 9214
fxg5+ 9205
Rdb1 9141
Kxc1 9112
Ndxe4 9105
h8=Q 9087
Nxg3+ 9069
Ne1+ 9068
Bg3+ 9023
Raxc8 9017
Rxh4+ 9004
Rff7 8962
Nfxd4 8952
fxg3+ 8937
fxg4+ 8890
Rcf1 8887
R8d7 8856
Red7 8832
Bxf5+ 8809
Bf7+ 8765
Rxa2+ 8747
fxg2 8679
Ba3+ 8677
Qxb5+ 8604
R1e2 8580
h1=Q 8508
N2f3 8485
O-O-O+ 8483
Rbf8 8416
Rcd7 8381
Bxg8 8371
Rea1 8367
Rff2 8337
Qxd3+ 8336
Rcb1 8297
cxb7 8278
Rdc2 8255
Bf2+ 8249
exf4+ 8234
Nac5 8212
Rxa7+ 8202
exf3+ 8188
Qxb4+ 8124
Rxa8+ 8119
exf5+ 8069
Ncd4 8029
Kxh1 8026
d1=Q 7983
Rxb3+ 7961
Rbb7 7934
Rbf1 7919
Neg4 7911
Qxh1 7881
exf2+ 7842
Rfxd8 7828
f7+ 7827
dxc7 7770
Raxd1 7721
Rhb8 7621
Rfe2 7609
Rhb1 7583
Rxc4+ 7500
Nhf3 7484
N1d2 7449
Ndc4 7411
Nxd4+ 7406
Rfd2 7402
N1h2 7391
Nac4 7343
Nfg5 7342
Rde7 7333
hxg7 7332
Rdc7 7316
Nxg4+ 7270
Ned2 7253
Rfe7 7223
gxf3+ 7187
Raxd8 7117
Qxa2+ 7086
Nxc3+ 7080
Nxc6+ 7076
Bxg5+ 7066
Nf8+ 7034
R8c7 7028
Nxg5+ 7010
Raa7 7009
Nxf2+ 6996
Nbxd7 6990
Ncb5 6948
c3+ 6884
c6+ 6881
e1=Q 6865
g8=Q 6854
Nf1+ 6846
Bxg1 6841
Bxd6+ 6827
Nd8+ 6777
Nxg8 6760
R8e7 6751
f1=Q 6733
N7b6 6691
Bxg3+ 6649
Nde7 6634
e8=Q 6606
gxh5+ 6592
Rea8 6583
Nxh1 6558
Qxa7+ 6535
Rge1 6527
R1c2 6497
Ba5+ 6496
Rxa1+ 6471
Rbb2 6470
Rxc5+ 6464
Raxc1 6457
Rfxd1 6454
axb2 6453
Nxc7+ 6427
f8=Q 6426
gxh4+ 6402
Rgf8 6365
Nfg4 6364
gxh7+ 6363
Ree3 6340
Nfxe4 6335
Ng7+ 6332
fxe7 6327
Nexd4 6324
Red3 6313
Be7+ 6310
g1=Q 6289
Rdh8 6268
Nhf4 6245
Rxb6+ 6238
Be2+ 6234
Qxb6+ 6222
Bxb4+ 6202
Nef5 6196
axb4+ 6194
Bxd3+ 6179
Rge8 6151
Rdd3 6116
f2+ 6107
N5f6 6095
Bg7+ 6089
exd5+ 6074
Ncd2 6070
Rgf1 6066
e7+ 6048
Qxa8+ 6031
Ndb4 5994
b6+ 5984
Nd1+ 5980
Bxe7+ 5954
Bc2+ 5897
Nxg7+ 5865
Nhf5 5856
Nef3 5834
fxe6+ 5822
Ncb4 5794
Rah1 5793
exf7 5764
Bd2+ 5750
Ndc6 5738
Nxc2+ 5686
axb5+ 5682
b3+ 5665
exd7 5656
bxc4+ 5643
Rah8 5633
Raa2 5622
Bd7+ 5613
Rxh8+ 5597
N1e2 5595
Rec2 5502
Ng2+ 5478
Qxa1+ 5472
Nfe8 5468
Rhh8 5436
Rhh1 5431
Ngxe4 5413
Nbc4 5394
gxh6+ 5393
Rgd1 5387
Rec7 5384
Nh7+ 5351
a5+ 5346
Rgd8 5336
Qxg8 5325
Bc7+ 5320
Qxg8+ 5275
d7+ 5246
Qxb8+ 5230
R1f2 5230
Rce7 5219
Ncxd5 5213
axb7 5200
Nexd5 5190
Nef4 5177
e2+ 5167
hxg2 5153
Bg2+ 5150
Nac6 5128
Nxc4+ 5125
Nac7 5108
Ref2 5093
a4+ 5084
R3d2 5081
Rfd7 5060
Bxb7+ 5041
Nfe7 5036
Nxg1 5020
R8f7 4999
Rce2 4997
bxc5+ 4986
dxe5+ 4943
Qxb1+ 4922
Ncxd4 4897
Nxc5+ 4896
Ndf8 4860
Ref7 4843
Na4+ 4841
dxe6+ 4838
Rgg8 4813
N5c3 4811
Rda1 4808
h7+ 4739
Nec5 4731
Bb7+ 4730
Nec4 4693
Rdf2 4692
Rca8 4666
Rxa6+ 4665
Rab7 4655
d8=Q+ 4653
Bf8+ 4646
Qxg1+ 4597
Qxb3+ 4583
dxc2 4567
Rdd6 4557
Rbc7 4537
Rcg8 4530
Rfe3 4502
Be8+ 4492
Na3+ 4489
Nc8+ 4475
Rfg8 4463
dxe2 4462
Rxb4+ 4444
Bxh6+ 4436
Bxb2+ 4403
Rde3 4401
Qxg1 4386
Nac3 4381
Qxh8+ 4378
exd6+ 4359
Bf1+ 4306
Kxb8 4278
Rxa3+ 4256
Nb7+ 4251
Nb2+ 4236
Rff3 4236
Nxh5+ 4231
Bb2+ 4227
Bd8+ 4219
Ned3 4219
Be1+ 4207
Nxh7+ 4203
Rac7 4129
Na5+ 4124
Nce6 4118
Nfxe5 4090
Ncd3 4089
gxf2+ 4089
Rxb5+ 4068
Ree6 4064
R1d3 4053
Nfe2 4052
cxd5+ 4049
Qg7# 4046
d2+ 4040
Rcd3 4012
Rba8 4003
Ndxb5 3988
cxd4+ 3971
Rfd3 3967
Ndc3 3939
dxe4+ 3937
Rgg1 3930
cxd7 3905
Nbc5 3885
Qxa6+ 3885
Nxd7+ 3882
e8=Q+ 3877
bxc2 3873
Bxg4+ 3871
N2b3 3865
Nc1+ 3860
Nh2+ 3860
g7+ 3844
Kxb1 3841
Rca1 3814
Rfg1 3797
Rcc3 3794
d1=Q+ 3792
Rcg1 3785
Rda8 3784
Bd1+ 3779
R3e2 3760
Ndf5 3744
Rgc8 3742
Bxe2+ 3738
bxc7 3722
Nce8 3717
exd4+ 3705
Nfe6 3691
N1f3 3658
N3d2 3651
bxc3+ 3649
N8e7 3621
N5b6 3601
Rbd7 3600
Ncb6 3599
c8=Q+ 3598
dxc5+ 3581
Ndf1 3547
fxg7+ 3528
Rfc2 3514
Nde3 3510
Nxb6+ 3502
Rbc2 3500
gxh3+ 3500
gxh2+ 3497
Ndf4 3489
Ned6 3479
Rba1 3470
e1=Q+ 3469
Rxh1+ 3468
c1=Q+ 3466
Rdf7 3461
Nfe3 3453
gxf7 3453
Reg8 3449
h2+ 3444
N2c3 3429
Rcc6 3427
Reg1 3403
Qxa4+ 3385
Qg2# 3377
Rfc7 3368
bxa2 3364
Rab2 3337
exf2 3304
Rcb7 3290
b8=Q+ 3289
Rae7 3288
Ngf5 3279
Na6+ 3273
Rgg7 3273
Ndb6 3265
f8=Q+ 3244
Nxg2+ 3240
R4d2 3223
fxe3+ 3223
Qxa3+ 3206
Rbd2 3204
R1e3 3197
g2+ 3194
dxc6+ 3186
Nxh4+ 3175
dxc4+ 3154
Red6 3124
N4f3 3120
Rbg8 3117
Bc1+ 3103
Bg1+ 3102
Ncd6 3094
Rac2 3092
b1=Q+ 3088
cxb4+ 3077
R8b7 3073
Bc8+ 3071
Nxh2+ 3059
Rad7 3056
Rff6 3047
Bxh3+ 2997
Rfxc8 2990
a8=Q+ 2985
Nxf8+ 2983
Qxh1+ 2980
Nxc8+ 2979
Rfe6 2977
fxe2 2976
a3+ 2969
Rgf3 2963
a6+ 2962
Nxe8+ 2959
N7c6 2955
bxa7 2949
R6e7 2946
R6d7 2944
cxd2 2942
N2g3 2937
N8h7 2936
Nfd3 2920
Bg8+ 2918
Nxd2+ 2914
Nxa2+ 2908
c7+ 2876
Ndb8 2857
Nbd3 2853
c2+ 2850
fxg2+ 2834
cxb5+ 2831
hxg7+ 2827
dxc3+ 2823
axb3+ 2821
Ndxc5 2805
f1=Q+ 2805
exd7+ 2800
Rgg2 2794
cxb2+ 2788
R1b2 2783
Bxc2+ 2759
Ngf4 2751
Rbg1 2743
Ng8+ 2711
Rdc3 2684
R3f2 2677
Nge6 2675
Rcb2 2669
Ref3 2664
Rcd6 2661
Raf7 2659
Rae2 2649
a1=Q+ 2637
Kxa8 2626
Rad2 2626
Rgc1 2625
Rxa5+ 2595
exd2 2588
Rgf7 2586
hxg2+ 2586
Nba6 2570
Nde6 2570
R1a2 2568
Rcf7 2568
Nhf8 2558
Nxa7+ 2548
Rha1 2544
Nab6 2541
Rha8 2537
g8=Q+ 2523
Qxa5+ 2517
Bxh4+ 2513
Rce3 2507
Nge3 2496
R8d6 2494
Rdf3 2492
N3h2 2491
Neg6 2488
Rxa4+ 2467
Rfe1+ 2454
Rbc3 2446
Rdd4 2433
Rec3 2412
N5f3 2408
gxh7 2406
Qh8# 2401
Nec7 2400
Rde6 2399
axb6+ 2399
Qxg2# 2394
Neg8 2392
Qxg7# 2372
h8=Q+ 2367
Rhf3 2366
R3c2 2364
Rcc4 2361
Kxa1 2359
Rbb3 2356
Nxb5+ 2344
Nfg6 2341
dxe3+ 2324
R8e6 2322
Rge3 2315
g1=Q+ 2314
Ncd1 2313
R6d2 2313
Rab6 2311
Rdd5 2311
Rdb7 2305
Nxf1+ 2302
Nac2 2297
Rcf2 2292
R6f7 2287
R6c7 2286
Rbc6 2286
Nhg4 2272
bxc6+ 2271
Nbd6 2264
R1c3 2260
Ndxc4 2256
Ngxe2 2252
Rbb6 2248
R8c6 2243
Rgf2 2233
Rbe7 2228
R8a7 2213
Rcc5 2213
Nxb4+ 2211
R4d3 2210
Rhh7 2183
Rgh1 2181
Ncxe7 2168
Rch8 2168
Nhf1 2153
Rab3 2151
Rfxf7 2140
Bxb6+ 2134
Rdb2 2134
Rgh8 2131
N4d5 2130
Ree4 2129
cxd6+ 2113
Rbxc8 2112
Nxe1+ 2111
Rch1 2098
N4b3 2096
Ndb1 2096
Rfg7 2096
R5d7 2079
Na2+ 2066
Bxh5+ 2064
Rh8# 2061
Nab5 2058
R4e2 2053
Neg3 2047
gxf2 2043
gxh2 2042
R1d4 2041
Rbd3 2037
Rhg3 2037
Ncxb5 2033
Raa3 2033
Ndb3 2026
Rfd6 2011
Rbe2 2005
Red4 2001
Reh1 1997
Na7+ 1996
Ngxe7 1995
Rhh2 1983
Nfe1 1977
R8g7 1977
Qf7# 1975
R5d2 1971
Ree5 1970
Ba2+ 1965
N7g6 1965
R1g2 1960
Rdc6 1942
Rgf6 1932
Ncb8 1931
Ngf1 1926
Rhe1+ 1923
Rh1# 1915
Nce1 1910
N8c6 1909
Qh1# 1909
Rac6 1906
Rbf7 1905
Raf2 1903
cxb6+ 1903
Nfd6 1902
Rfg2 1899
Ng1+ 1898
h1=Q+ 1893
R4f2 1884
Rhg7 1872
Nxd8+ 1871
Qh7# 1871
Rac3 1863
R5e2 1861
Ngf8 1857
R5e3 1846
Rba7 1842
b7+ 1841
R1f3 1837
Rhg2 1837
Nab4 1831
R4c7 1823
N5c6 1821
Raa6 1816
Rfxe8 1807
Rad1+ 1800
Reb7 1793
Ba7+ 1792
Naxc5 1789
Reb2 1781
cxb7+ 1780
Nhg5 1764
cxd2+ 1759
Rhd3 1753
Rhd2 1751
R5e7 1742
Rgb8 1733
Rca7 1730
R5d3 1721
Rfb7 1719
Ncb3 1707
Reh8 1704
N6h7 1696
cxb3+ 1693
Rfxf2 1691
Rfg3 1690
Rge7 1682
Rff4 1677
bxa5+ 1677
Rfh1 1675
Nfxd7 1674
Rbd6 1673
Rgd3 1673
N3h4 1669
Bxc7+ 1665
Rde4 1665
R1d6 1662
Rdxd7 1656
R4e3 1655
bxa4+ 1654
Qf8# 1653
R5f7 1653
Rexd8 1651
Rdxd5 1645
Ncb1 1644
Red5 1632
Nxb7+ 1627
Rfxc1 1622
Rcd4 1620
Rdxd6 1619
exf8=Q+ 1614
Rbh1 1597
Naxc4 1592
R8f6 1591
N6d5 1590
Raxb8 1587
Ref6 1583
N6h5 1582
Rac4 1575
Rfe8+ 1574
Bxf8+ 1568
Rbh8 1566
Rec6 1562
R5c7 1561
Rdxd4 1560
Qxh7# 1557
exd3+ 1550
Rgg3 1543
Bxa2+ 1541
Rfxe1 1540
Rfe4 1539
Rge2 1534
Rhe3 1533
b2+ 1532
Rcd5 1531
Rhg6 1527
Rfb2 1525
Rac5 1519
Nfg3 1517
R2d3 1515
Rfh8 1512
Rce6 1510
N3d4 1496
R4c6 1496
Rbf2 1489
Rbxb7 1485
Rdh2 1480
Rcb6 1471
R7d6 1470
Rba2 1470
Nxd1+ 1468
Rgb1 1467
Ndxf6 1466
axb2+ 1461
Rdc4 1460
Rbb4 1449
N5e4 1445
Rcb3 1445
Bxb3+ 1442
Rfe5 1442
Nfh5 1441
Rexe6 1441
N3e4 1438
Rhf6 1435
R5c2 1430
R4f3 1424
Rexd1 1419
Rgd2 1410
Qg8# 1409
Rexe7 1406
Qh2# 1405
Qf2# 1398
Rbxb2 1396
Nb8+ 1393
R8d5 1392
Rff5 1390
Nfg8 1387
Nxb2+ 1387
R1d5 1387
N5d4 1385
a7+ 1385
Nfxd2 1378
Rdg2 1378
Rca2 1372
R5d6 1370
Re8# 1364
Rfg6 1364
Nbc8 1359
a2+ 1344
Nec8 1341
Rdxd3 1341
R6d3 1335
Rfd4 1331
Rge6 1331
Rexe4 1328
Rdf6 1326
Qxf7# 1325
Bxa6+ 1322
Qf1# 1317
Rad3 1314
Rde5 1314
Nb1+ 1310
R8d4 1309
Rcxc3 1305
Nab1 1303
Rbc4 1295
Rexe5 1293
R5c3 1292
R6d4 1291
Bb1+ 1277
Rbd4 1275
Rhxf1 1274
Rhf4 1271
Neg1 1269
Nec1 1263
Rbb5 1263
bxa3+ 1260
cxd3+ 1253
Raxe8 1251
Nab8 1248
R4e7 1243
Nxa3+ 1242
R1e4 1242
R8c5 1240
Bxf1+ 1237
Rba6 1236
Nec2 1234
Rae1+ 1234
Re1# 1232
Ndf2 1229
Qe8# 1229
Reg2 1228
R6b7 1225
Nxa6+ 1221
Rcxc2 1219
Nbc1 1217
Ngh5 1216
Nexc4 1213
Nba3 1210
Nab3 1208
Rgg6 1206
R8d3 1205
R1h2 1204
bxc2+ 1202
Rcxc7 1201
Rae3 1198
Nexg5 1196
Rexe3 1196
R4c5 1193
Rba3 1191
Rdb3 1191
Rbd5 1190
Reg7 1189
Rgh3 1188
R4c2 1187
Nhf7 1185
Qg1# 1182
Rhg1+ 1180
N4c3 1179
Nfxg4 1179
Qe7# 1178
Nfxg5 1177
Qe1# 1175
Qb2# 1174
Rhh3 1174
Raa4 1173
Rd8# 1173
Rdc5 1173
Rbc5 1172
Rcxc6 1171
Bb8+ 1169
Rbxc1 1169
Nhf2 1168
Raxa7 1167
Rgf4 1162
R4e6 1155
Rhf2 1155
Nexc5 1152
R5e6 1151
Qb7# 1150
Reg3 1150
R1c6 1140
Rfd5 1140
bxa2+ 1137
Nba4 1133
R1c4 1133
R5f6 1133
Nxc1+ 1132
Nca4 1131
R1a3 1129
Qh6# 1128
Rda2 1128
Nxa4+ 1127
Rac1+ 1127
R6d5 1124
R7c6 1124
R8b6 1124
R1b3 1123
Rda7 1117
Rfc3 1113
Rac8+ 1112
Rgd7 1112
R8c3 1110
Rhg7+ 1109
Rcxc4 1106
R2c3 1098
R8e5 1098
R8c4 1095
N3e2 1093
Rea2 1090
Nbxd6 1089
Nfd1 1089
Rad6 1088
cxd7+ 1088
Qxh2# 1083
Rab5 1083
Rea7 1083
Rab4 1075
Rf8# 1075
Rhe2 1074
Rbe3 1071
Qg5# 1070
R3b2 1069
R5d4 1063
Rgh7 1062
Ref4 1061
Bxa4+ 1057
N4c6 1057
Rhf5 1056
Ncd8 1053
Rhg2+ 1052
R8h7 1050
Rcxc5 1047
Rec4 1045
Ncxe2 1044
Nexf5 1042
Nexg4 1042
R4d7 1042
R5c6 1035
Rce5 1035
Rexe2 1035
R2e3 1031
Raa5 1029
R5e4 1026
Rhf7 1023
Ncxd6 1022
Qh5# 1021
Raxa2 1019
Rdxd2 1019
Qd8# 1015
Rce4 1015
Rhe8+ 1007
Nxa5+ 1006
Qg4# 1004
Nexf4 1002
Rca4 1001
Rdb6 999
Qh4# 998
Rad8+ 995
R4f7 994
Rca3 994
Nbc7 993
Qe2# 992
N4e5 987
R5f3 987
Rd1# 987
Qh3# 984
R5f2 982
Raxe1 982
N6e7 981
Ndc7 980
R4f6 978
Rdf4 978
Rgf5 977
Rca6 975
Rhg4 974
R1e5 973
N2c4 970
Qg3# 969
R7e6 967
Rgh2 967
Rca5 965
Rdg7 962
dxe7+ 960
Rh7# 957
N8c7 953
Rge5 952
Ref5 950
Rexd5 948
Rhd7 947
Ngxf6 945
Ra1# 942
R1e6 938
Rcxd8 938
Rcf3 933
Rg8# 932
N5g6 930
Ngxe6 927
Rfxf6 927
Ngxf7 926
Qg6# 925
Nge8 920
Rfa7 919
Rhg8+ 918
Rhh6 918
N6e5 917
R1c5 917
gxf8=Q+ 917
R1a6 916
R8a6 915
Rge4 914
axb7+ 913
Bxa3+ 912
R3d7 912
R8e4 911
Rhe7 908
Nfxe6 904
Rfh3 904
Nhg7 903
R8a3 903
Bxe8+ 901
Nexf6 901
Rf1# 899
Raxb1 895
Rec5 895
Ndf7 891
Ra8# 889
Rgc7 886
bxa6+ 881
Rae8+ 879
dxe8=Q+ 879
Ndxe6 877
Rcb4 875
N1a2 872
Rgh6 872
Rhg5 872
Rcxd5 868
R4d6 864
Rfa2 862
Rhe6 862
N4g3 861
R4b7 858
R2d4 856
Rhd4 853
R4c3 850
Ncxb4 848
Nhxf4 847
Rexd4 846
fxe7+ 844
Bxa7+ 841
Rad4 841
Rcb5 840
Nhg3 838
Nhxf5 836
R7d5 835
Qd7# 832
Rad5 832
Rfd1+ 830
Rgc2 830
Rcxd4 829
Raxa6 828
Rhe4 823
Rgg4 822
Qd1# 821
Rdg3 819
Qxf2# 818
Rcg7 818
Ndxe7 817
R1f4 813
Rfxf3 813
Rdxe5 810
Rga8 805
Rhxf8 805
Nbxc5 804
R6a7 804
Nhg6 803
Nba5 801
Rfxf4 797
Raxa4 796
R6g7 793
exf1=Q+ 791
Nfg1 787
Nh8+ 785
R4d5 785
Nbxc4 782
R4e5 779
Rae6 779
Qd2# 775
Qf6# 775
Rfxf5 774
R3d4 771
N6a5 770
Nac1 769
Raxa5 767
Rcg2 766
Rg1# 766
R5c4 764
R3g2 761
Rh2# 761
Nexd6 760
Ngh2 760
Bxa5+ 757
Ndxe2 756
Nhxf6 756
Rcxd6 755
Ndc2 754
N7c5 752
Rba5 750
Rdb4 749
O-O+ 747
R8e3 744
Rbxd8 744
Rgg5 743
Rbxb5 742
Rbxb3 740
Reb3 740
Rga1 740
R2c4 738
R6e2 738
Rfh2 738
Rbxb6 737
Rbe6 736
R2e4 734
Rba4 734
Raf3 732
Bxd8+ 730
N7xf6 729
Rdxe4 727
Rcxd1 725
Qxf8# 721
Nef8 719
R1g3 719
Rdb5 719
Rexc8 718
exd2+ 717
Nab2 714
Nfh4 712
Rexd6 711
R1d7 709
Rgh4 709
Ndxf3 707
Nef1 706
Nca5 705
Ncxe6 705
R1a5 705
R8g6 702
Rbxb4 701
Rgd6 701
Rgxg7 701
Rhh4 699
R3c7 698
Reg6 698
R5f4 696
R4f5 695
Rfh4 695
N3a4 694
Qc7# 693
R6e5 692
Nca6 691
Qe6# 690
R3c4 689
R4b2 689
R7e5 689
Ke3+ 688
R5b7 688
Ngf7 687
Rfg4 687
N5a3 686
Naxb5 686
R3a2 685
Ngxf3 683
Rfxf7+ 683
Rc1# 681
Rc8# 681
dxc8=Q 680
R7c5 678
Rdf5 678
Rfh7 673
R4b6 671
R6f4 671
R8d2 667
Rbf3 667
Rexd3 665
Qf3# 664
R3d5 664
Ngh7 663
Rfd8+ 663
R2a3 660
Bxe1+ 657
R8f5 657
Rfh6 657
Ngxf5 656
Neg7 655
Rgxg2 655
Nexd7 654
Nbc2 653
Ndxf5 653
Kd3+ 649
Rhe5 648
R7b6 646
Rh4# 646
Rhh5 646
Rdxc8 645
N7e6 644
Ndxf4 644
R7d3 644
N7d5 643
R7f6 642
Nh1+ 641
R7d2 641
Qa1# 639
Rh6# 638
Rdh3 637
R3e4 636
Rdxe6 636
Ke4+ 635
R6e4 635
R6f2 635
R1xd4 634
Rfc6 629
Nfd8 627
R1a4 625
R6c2 623
Rh3# 623
Nhg2 620
Ngh6 619
Ned1 618
Rfg5 618
Reh2 617
R1b6 616
Ke6+ 615
Nbc7+ 615
Bxg8+ 614
Rgh5 614
dxc7+ 614
Kd4+ 612
R6c5 612
Ke5+ 608
Nexd2 608
Rhc2 607
Qa8# 606
R8a4 606
Rfxe6 606
R2f3 605
Raxa3 604
Neg5+ 603
dxc2+ 601
R1h7+ 600
Rgd4 599
Nde8 597
Qf5# 597
N4a5 596
N7e5 596
N2e4 594
R8b3 594
Rfh5 593
R4a3 592
R2b3 591
Qe3# 589
R1c7 589
R4b3 589
Rdxc3 589
R8a5 588
Nab7 587
Ndxb4 587
R6e3 587
Rgc3 587
Rag7+ 586
Nhg8 581
N8e6 579
R1h3 579
Ngh3 578
Rhf1+ 578
N8f6 577
Rb8# 577
Qc2# 576
Rda3 576
Rdxe3 576
R8c2 573
Rdxc4 573
R7c2 572
N8a7 570
Rag2+ 570
Nac8 567
Ncxd3 567
Nde1 566
Nef6+ 565
Nf7# 565
Rbg7+ 564
exd8=Q+ 564
N1c2 563
R7a6 563
R7d4 563
Qxh6# 561
R3c5 561
Rdxc5 558
N1e3 556
Rb1# 556
Reh3 556
R3f4 555
R5b2 554
fxe8=Q+ 554
Rae4 553
Nbxc6 552
R5b6 552
Rfb3 551
Rhc7 550
N1d3 549
Kf3+ 548
Qxf1# 548
Rbxd1 548
R6f3 547
Qc8# 546
Rdh7 546
R5a6 545
Nexc6 544
R6c4 544
Rhd5 544
Nexc3 542
R5b3 542
Ngh4 541
R4a2 540
Rda5 540
Qf4# 539
Kd6+ 536
N7a6 536
Bxd1+ 533
Kd5+ 529
R1xd5 529
R6f5 529
Rh5# 529
Rea3 528
Qc1# 527
bxa8=Q 527
gxf1=Q+ 527
R1b4 526
Rhxh7 526
R8b5 525
R3d6 524
N6xd5 523
R5a7 523
Rfxe4 522
bxa1=Q 522
Ncxe3 521
Kf6+ 519
Nexf7 517
Rag7 517
R3e7 514
Rde1+ 513
Rexc1 513
Rhd6 513
cxd8=Q+ 513
Bxg1+ 511
N3c4 511
R8b4 511
R3e5 510
Rhc3 510
Nxh8+ 509
N4xd5 508
R5a4 508
Rdxc6 508
Rfxf2+ 508
Reb6 507
Reg5 507
Rf7# 507
cxd1=Q+ 507
R2c7 506
R3f7 506
R7e3 506
dxe1=Q+ 505
R2d6 504
Rdg1+ 504
Nbxd3 502
Qd6# 502
R7c3 502
Rcf6 502
Rfxe5 502
R5g3 501
R7e2 501
Rexd7 501
Ngf2 500
R4b5 498
Rae5 497
Rcxd7 496
Rda6 496
Reg4 495
N8g6 492
R2c6 491
R1e7 490
Reh7 490
Rbe4 486
Rfxe3 484
R1d7+ 483
R2d5 482
Rcg7+ 482
Rbg2+ 481
R6c3 480
Rcxe4 480
Ndxf7 478
Qb6# 478
Qb4# 477
exd8=Q 475
Qb5# 472
Qxh3# 472
R8h6 471
N2d4 469
Kf5+ 468
Rcxc8 468
Rgd5 467
Naxc3 466
Rxf8# 466
Kf4+ 465
Ndb2 465
Nef3+ 465
R1e7+ 465
Rcg2+ 465
N1f2 463
Nxg8+ 463
fxe2+ 462
Ncxd7 461
R3b7 461
Rab8+ 461
R5a2 460
R1a7 457
R3f5 457
Ndxe3 456
Ngxf2 455
Qe5# 455
Nf2# 454
Nca3 453
R4g6 453
Rdxc1 453
R5b4 452
Rexd2 452
Nef7 451
Neg4+ 451
R1xe4 451
R3a4 451
R8e2 451
Rxe8# 451
R3c6 450
Rgf7+ 450
R3f6 449
Nfg5+ 447
Rda4 446
R7e4 445
bxa7+ 445
hxg8=Q+ 445
Rbxc4 443
Rgf2+ 443
Nbxc3 442
Ngxf4 442
Rbxc6 442
R8xd5 441
Rcf4 440
Rxh7# 440
R1e2+ 439
R2d7 438
R7c4 438
Raxb4 438
Rexf5 438
N3g4 437
Rfc4 436
Neg2 435
R6a5 435
Rdxf1 435
Raxb5 433
Rcxd3 433
Nf6# 432
R6xd5 432
Ndxc3 431
R8e2+ 429
Nfh2 428
N2e3 426
Nfxd6 426
R4g3 426
Rag2 426
R3b4 425
Raxf8 425
Rbg7 425
Rch2 425
Rgxg7+ 425
R6b3 424
R8f4 423
Rxe1# 423
R5g2 420
R1xd2 419
R5g7 419
R8d7+ 417
N3xd4 415
N4h5 415
R6b2 415
R8h2+ 415
Rgb7 415
Ned6+ 414
Rexf4 414
R5a3 412
R8a2 411
Raf6 409
Rbxc3 407
Rgb2 407
Rxf1# 407
R4g7 406
cxb8=Q 406
Nhg1 405
R1b5 405
R8xd7 405
Nef2 404
R4g2 404
Rfxe7 404
N1g3 403
R1b7 403
R6b5 402
Rfc8+ 402
Rbf6 401
N8d6 398
Rcxd2 398
Rdxe7 398
Rgxg6 398
Nexf3 397
R2e6 397
R2f4 397
Nexd3 396
Qxe1# 396
Ndb7 395
Qe4# 395
N4xe5 394
R2b4 394
R8e7+ 394
N4f5 393
g4# 393
N6c5 392
Na8+ 392
R1d2+ 392
R3b6 392
Nhf5+ 391
Qb8# 391
Rab1+ 391
Raxc5 391
Rbe5 391
N6xe5 390
Nhxg4 390
R4a5 390
R2e5 389
Kc5+ 388
N8xd7 388
R5g6 388
Raxb2 388
Rf2# 388
Rfc5 387
Rfxd6 387
dxe2+ 387
R1h6 386
Rfxb8 386
N4a6 385
R3e6 385
dxc8=Q+ 385
Naxc6 384
R3h2 384
Ng6# 383
Qb3# 383
R2e7 383
Raxc6 383
N5e6 381
Rbxd5 381
Rdg7+ 380
Raxd6 379
Rbxd6 379
Rhxc8 379
Ke7+ 378
N6f5 378
Raxb7 378
Rdh4 378
Rdg6 377
Kc4+ 376
R1xd3 376
R4a7 376
Rdxf7 376
Kc6+ 374
N3f4 374
R8f7+ 374
Ngf6+ 373
R1f5 373
R1h4 373
Bxc8+ 372
N4c5 371
Rbg2 371
Ncxb6 370
Nf3# 370
R6b4 370
Raxc4 370
bxc1=Q+ 370
g5# 369
Reh4 368
Reb4 367
Rgxg2+ 367
R8xd6 366
Rfxe2 366
Rbxa4 365
Rdxc2 365
bxc7+ 365
Ndf6+ 364
Nfxe3 364
Qd3# 364
Rgxg3 364
Rhxh2 364
N5c4 363
Qxe8# 363
Rcxe5 363
Ned8 362
Nhxf3 361
dxe8=Q 361
N3xe4 360
Nhxg5 360
R2c5 360
R3b5 360
Rdg8+ 359
N3d5 358
Raxb6 357
Rhxh5 357
N5a4 356
Rcxb4 356
Nhf6+ 355
R1f6 355
Rea4 355
R8d2+ 353
Rdxd8 352
Rgc6 352
Rgxg5 352
Nef5+ 351
Raxb3 351
Rfxd4 351
Qb1# 350
R1f7+ 349
Raxc3 349
N6g5 347
R7b3 347
Rhf8+ 347
exd1=Q+ 347
Na1+ 346
Qd4# 345
Rexf6 345
Ke2+ 343
R8h7+ 343
R7g6 342
Ncd6+ 341
Rbxd4 341
Rcxf7 341
N8g7 340
Raxd5 340
Re7# 340
Rexf7 340
Ndxc6 339
R5g4 339
Rfb6 339
Rfxd5 339
Ndf3+ 338
R2g3 338
R4a6 338
R6h7 337
Nde7+ 336
Rdxe2 336
Ng3# 335
R8xe7 335
Rbxc5 335
dxc1=Q 335
Ngf5+ 333
fxe8=Q 333
Nfg4+ 332
R8b2 331
N8a6 330
Rcg3 330
Rhb2 330
cxd8=Q 330
R1xe5 329
Naxb4 328
Rea6 328
Rexf3 328
Bxc1+ 327
fxe1=Q+ 327
R3a6 326
R8h5 326
R4g5 325
N5f4 324
Ncd3+ 324
Rbxa5 324
Kc3+ 323
R8h3 323
R8xc5 323
Nbd6+ 322
R2a4 322
Rcxb5 322
Reh5 322
fxg8=Q+ 322
Rdxc7 321
Rfc1+ 321
Kd7+ 319
Nhf4+ 319
R8xd4 319
Qxg6# 318
R6a4 318
Reb5 318
R7f3 317
R7f5 317
Nfh7 316
Qd5# 316
Rch7 316
Rexc4 316
R1d6+ 315
R1h5 315
R8h4 314
Ngxe3 313
R1xc4 313
R1xe2 313
Rfa3 313
Ndc1 312
Raxd7 312
Rxh6# 312
Nxh1+ 311
R1e6+ 311
Nbxa4 310
R3a5 310
R8f3 310
R8xe5 310
Rgc4 309
R1h2+ 308
R2b7 308
Rgxg4 308
bxc8=Q 308
Bf6# 306
Nge1 306
R7a5 306
Bh6# 305
N2d3 305
Rdg4 305
Rxh2# 305
Nfh3 304
Qxb2# 304
Kf1+ 303
R7b5 303
R8xc6 303
Rcxb7 303
Rcxc1 303
Rde8+ 303
Rdf1+ 303
gxh8=Q 303
Nbd8 302
Rd7# 302
Re2# 302
bxc8=Q+ 302
Nfxg6 301
R1xc2 301
R2b6 301
Rcf5 301
R2f6 300
R5xd4 300
Rexc3 300
R3a7 298
R8c2+ 298
Rgc5 298
axb8=Q 298
Kf7+ 297
Nbxc7 297
R1xe6 297
Rcxe6 297
Rcxe7 297
Raxd4 295
Rfxd7 295
R1xc3 294
Rdxf2 294
Reh6 294
cxd1=Q 294
Qxb7# 293
Rbf4 293
Rdg2+ 293
Rea5 293
Qa4# 292
R3g4 292
Rhd1+ 292
R1g4 291
R8g5 291
R7f4 290
R8xe6 290
Rexc6 289
Ncxb3 288
Ndxb6 288
R8f2+ 288
N1g2 287
Rg7# 287
N6c7 286
Rcxe3 286
Rbxe4 285
Nh6# 284
Rhxh4 284
Rhxh6 284
cxb1=Q 284
Qxe7# 283
R1f2+ 283
N2xf3 282
Nbd1 281
Ndc8 281
Ned3+ 281
Kf2+ 280
Ndf5+ 280
Rxh3# 280
Bf3# 279
N4g5 279
Rhb7 279
Naxb3 278
R1xf2 278
Rdxf6 278
Rfxd2 278
Rhc4 278
R4h2 277
Rexe8 277
Kg4+ 276
Nxg1+ 276
Rfxd3 276
Rxd1# 276
Kg3+ 275
Qa3# 275
Ndxf2 274
Nxb8+ 274
R6a2 274
R7b2 274
N5xe4 273
R7f2 273
Raxc7 273
Raxf1 273
Rdxd1 273
Rhd8+ 273
Rbxc2 272
Kd2+ 271
Ncb7 271
Rdg5 271
Rdxe8 271
Rhc5 271
N1a3 270
Nexg6 270
Rdxe1 270
Rdxf8 270
Qxc2# 269
R5h4 269
Raxf7 269
Rgb3 269
Rxd8# 269
bxc1=Q 269
Kf8+ 268
Qc3# 268
Rbxa6 268
Naxb6 267
R5h7 267
R6h4 267
exd1=Q 267
Kg6+ 266
N3e5 266
Ne7# 265
Nexf2 265
Nfxd3 264
R1c7+ 263
R1xe3 263
R5h2 263
Rcxb6 262
Raf4 260
Qa7# 259
Rdxf4 259
Rfxf8 258
f8=N+ 258
Qa5# 257
R8d3+ 257
R8xf7 257
Rag8+ 257
N1xd2 256
Qc4# 255
Rexe7+ 255
N4f6 254
N5h4 253
N8b6 253
R6g5 253
R8xc7 253
Rah2 253
Re3# 253
N2f4 252
R4h3 252
R8xe4 252
Rag1+ 252
Rcxb2 252
Rdh5 252
Rdxf3 252
Nbd3+ 251
Nfe5+ 251
R8e3+ 251
Rdh6 251
N3c5 250
R5h6 250
Rexf2 250
N8f7 249
Ncd5+ 249
Rcxf2 249
Rhxe1 249
Nfe4+ 248
R2a7 248
Rhxd8 248
Rhxe8 248
Kg5+ 247
N7b5 247
Rbxd7 247
R1c2+ 246
R1h7 246
R2a6 246
N4b5 245
Ra7# 245
Qa2# 244
R6h5 244
Rcxa5 244
R7b4 243
Rbxc7 243
Nce4+ 242
Qxh4# 242
Raxc2 242
Rexe6+ 242
Rhxf5 242
R2f7 241
Rexc5 241
Rg2# 241
N5g4 240
N6c4 240
N7d6 240
Qc5# 240
R1xc5 240
R4h7 240
Rf3# 240
Rhxd4 240
Nd6# 239
Qxc7# 239
R8c7+ 239
Rhxh3 239
Ndxb3 238
Qc6# 237
Rd2# 237
Rgxf1 237
e8=N+ 237
N5xf6 236
Rdxd7+ 236
Rfb4 236
Qa6# 235
Rcxb3 235
axb8=Q+ 235
Kc7+ 233
R2f5 233
R7a3 233
Nbxa5 232
Nde4+ 232
Rexb7 232
Rgxf4 232
hxg1=Q+ 232
Bg6# 231
N6b5 231
R1xd6 231
Qxd8# 230
R6a3 230
R8xb7 230
Rbxa7 230
axb1=Q 230
Nde5+ 229
N5xd4 228
Nfg7 228
R3g5 228
Raxe6 228
Red1+ 228
Nhf3+ 227
Raxd3 227
Rfe7+ 227
Nfh6 226
R6xd4 226
R7a2 226
Qxh5# 225
R6g4 225
Rexc7 225
Rfxf1 225
Rhc6 225
Nfd3+ 224
Qxd1# 224
R2g4 224
axb1=Q+ 224
Bh3# 223
N7f5 223
Rah7 223
Rbxd3 223
Rf6# 223
Rhb3 223
Rhxe4 223
Nhxg6 222
R3h4 221
Raf7+ 221
Rfb5 221
Rgxf6 221
Qxf6# 220
Rbxe8 220
Rhxe5 220
N7xb6 219
Rhg3+ 219
R7xc6 218
Rcxa4 218
Rg4# 218
N3a2 217
Nexg3 217
Qxg3# 217
R5xe4 217
R6xe5 217
Ra3# 217
Rcxe8 217
Rgxg6+ 217
Be6# 216
N3b4 216
Ncxd2 216
Ngf3+ 216
R4h5 216
Rfxc3 216
R7g5 215
R8xf5 215
Rbxe6 215
R3g7 214
Rbxe7 214
Re6# 214
dxe1=Q 214
Rexc2 213
R1b7+ 212
R7xe6 212
Rgxf8 211
Rhxf4 211
Nfxg3 210
Rch3 210
Rdxb3 210
N1b2 209
N4e3 209
Ngf4+ 209
Nxa8+ 209
R2b5 209
R4xd5 209
R8c3+ 209
Rbg3 209
Rexe1 209
dxc1=Q+ 209
Nde2+ 208
Nfxe7 208
R8xc3 208
Rgxf3 208
Rhc8+ 208
Nef4+ 207
R1xc6 207
R2a5 207
Rdxf5 207
Rf5# 207
Rfe2+ 207
Ncb2 206
R1xb2 206
R8b2+ 206
Rgf8+ 206
Nfe7+ 205
R7a4 205
R7h6 205
R8xb5 205
Rfa4 205
Rhxf3 205
Nf5# 204
R2xc3 204
Nba7 203
Nce5+ 203
Nhxf7 203
R3xd4 203
R5h3 203
Raf5 203
N6e4 202
Rdxb4 202
Be5# 201
Nce6+ 201
R3g6 201
Ra6# 201
R2h3 200
Raxe7 200
Rcxc2+ 200
N5b4 199
Nde6+ 199
R4xc5 199
Raxd2 199
Rexb2 199
Rf4# 199
Bxb8+ 198
Nfd6+ 198
Qxg5# 198
R4h6 198
R6g3 198
Rbh7 198
Rcg6 198
R8h3+ 197
Rbxa2 197
Nxb1+ 196
R1h6+ 196
R1xf4 196
Ra2# 196
Raxe4 196
Rag3 195
Rbxe3 195
Rdxb2 195
Rg6# 195
Nce7+ 194
Qxg8# 194
Rfa6 194
exf8=Q 194
Bg5# 193
Bg7# 193
Ncxa4 193
R6h2 193
Raxe3 193
Rbf2+ 193
f4# 193
N4e6 192
R7e6+ 192
R8g4 192
Rbxf7 192
Rfxb1 192
Rgxf5 192
Rhxd3 192
Ncd4+ 191
Qxe2# 191
R1g5 191
R8xc4 191
R8xe3 191
Rg5# 191
R6g2 190
h4# 190
Nd3# 189
Ne2# 189
Rab2+ 189
Rcxf3 189
Rhg6+ 189
Nge6+ 188
Nhxg7 188
Qxd7# 188
Rhxg5 188
Bf7# 187
Nhxg3 187
Rfxc7 187
fxe1=Q 187
Nf4# 186
Nfd5+ 186
Rge1+ 186
N6d4 185
Ndf4+ 185
R7xd6 185
Raf2+ 185
Rbxa3 185
Rgxe4 185
Rgxf7 185
Nexf6+ 184
Nh3# 184
Rcxf4 184
N4d3 183
Nce3+ 183
Nfxe8 183
R1f6+ 183
R8xa7 183
R8xf6 183
Rbh2 183
Rdxb5 183
Reg7+ 183
Rgf1+ 183
Rgxe6 183
Rhf7+ 183
f1=N+ 183
f5# 183
Nge4+ 182
Rbxe5 182
Rcg4 182
Rdxb7 182
Rexe2+ 182
Rgxd4 182
N2a3 181
R1xf5 181
Rbf7+ 181
Rhxe6 181
fxg1=Q+ 181
Rd6# 180
Rfg7+ 180
Rgxe5 180
Rgxg3+ 180
Ne6# 179
Nfe2+ 179
R8a2+ 179
Raxf2 179
Rcxa6 179
Re5# 179
Rfa5 179
Rcxe2 178
R1g7+ 177
R4xd3 177
Rbxf2 177
Kc2+ 176
N3c2 176
R1xf3 176
R6h3 176
R8g7+ 176
Rbf5 176
Rfxf3+ 176
R7xd5 175
... 174
Ned5+ 174
Nge3+ 174
R7d6+ 174
R8h2 174
Rgxe3 174
Rhxg4 174
N2xb3 173
Rcd1+ 173
Rhxf7 173
Ncxa5 172
Nfe6+ 172
Raxe5 172
Bg2# 171
R8g2+ 171
Ra4# 171
Rbxe1 171
Rga7 171
R8g3 170
Rdxb6 170
R1a7+ 169
R1c6+ 169
Rfxf6+ 169
Rg3# 169
R1xa2 168
R4xe5 168
R7f6+ 168
Rbc8+ 168
Rhxe3 168
Ke1+ 167
R1g2+ 167
Rc7# 167
Rcxe1 167
Rhxd1 167
g3# 167
R3xd2 166
Red8+ 166
Qxg4# 165
Rcf2+ 165
Nbxa6 164
Rc2# 164
Rcf7+ 164
Rfxc2 164
h5# 164
Bd4# 163
Ng5# 163
R2d3+ 163
Rab7+ 163
Bd3# 162
Bf4# 162
N4d6 162
Nc7# 162
Ndc7+ 162
R6xf5 162
Rd3# 162
Rga2 162
g6# 162
gxf8=Q 162
Bg4# 161
Rd4# 161
Rgxd3 161
Rhxg8 161
Be4# 160
Kg7+ 160
Ndxc7 160
Nexg7 160
Rbh3 160
Re4# 160
Rgb6 160
Rhxf6 160
N7g5 159
Ne4# 159
Nexf3+ 159
Ngxh5 159
Rgxd6 159
Qxf3# 158
R8f3+ 158
Reg2+ 158
Rfg2+ 158
Rgxh5 158
Nd5# 157
Nfe3+ 157
Rah3 157
Rfxg4 157
Rxh5# 157
Bd6# 156
Kb6+ 156
R2h4 156
a8=R 156
cxb8=Q+ 156
e1=N+ 156
R1f7 155
R2xb3 155
R3h5 155
Ra5# 155
Rdf7+ 155
Be3# 154
Rfxg6 154
Rga3 153
N5a6 152
N6a7 152
Nca7 152
Ndxf8 152
Nfg2 152
Rxh4# 152
Ncxe8 151
Rcxa3 151
Rha2 151
N5e3 150
Nbd5+ 150
Nxf7# 150
R3h7 150
R7h3 150
Rexf8 150
Kh5+ 149
N2g4 149
R3h6 149
R5xc4 149
R6xc5 149
Raxe2 149
Rhxc1 149
Ke8+ 148
N1b3 148
Nba2 148
Ncxb1 148
R7h5 148
R7xd4 148
Rbxe2 148
Rfxg5 148
N1xe2 147
N3b5 147
Ngxe6+ 147
Nxa1+ 147
R7xb6 147
Bf5# 146
N7xe5 146
R1xb4 146
R2e3+ 146
R8f2 146
R8xd3 146
Bg3# 145
Kh4+ 145
N2b4 145
R4xb5 145
Rdxa6 145
Rgxd5 145
d8=N+ 145
N4g6 144
R3xe4 144
Rcxa7 144
Rhxd5 144
Ngf7+ 143
Ngxh7 143
R8b7+ 143
Rbd1+ 143
Rcg5 143
Kg2+ 142
Nce2+ 142
Nexc1 142
R1a2+ 142
R7g3 142
Bxb1+ 141
R2xe3 141
R3xc4 141
R7h4 141
Raf1+ 141
Rgf6+ 141
Rhxg1 141
Bf2# 140
Nbxc8 140
Nde3+ 140
R2xd3 140
Rdf2+ 140
Rge8+ 140
Rhf2+ 140
Rhxh7+ 140
Nexc8 139
R2g6 139
Rcg8+ 139
Rcxf6 139
Rexe3+ 139
Bd5# 138
R2xd5 138
R6xe4 138
R7h2 138
Raf8+ 138
Rbc1+ 138
Rcxf5 138
Rha7 138
Rxg8# 138
Kg1+ 137
Ne3# 137
Qxg1# 137
R2f3+ 137
R5xd6 137
R8xb6 137
Rxc8# 137
a1=R 137
fxg8=Q 137
Kb3+ 136
N6xd7 136
Nge5+ 136
R3xd5 136
Rexf1 136
Rfxc6 136
N6xc5 135
Nca2 135
R2c3+ 135
Rce1+ 135
Ref7+ 135
Rfxc4 134
Bc3# 133
N5d6 133
Qxd2# 133
Raxf3 133
Rhxg3 133
b8=R 133
Ndf7+ 132
Nfxh5 132
Nhxg2 132
R1b2+ 132
R7xf6 132
Rbxd2 132
Rdxa4 132
Ref2+ 132
Rexb3 132
Rhg5+ 132
R1g6 131
R8xf4 131
Raxa8 131
f8=Q# 131
Ne5# 130
Qxe6# 130
R1xa4 130
R1xb5 130
R2g5 130
R2xd4 130
Rhxg6 130
Kb5+ 129
Kh6+ 129
Nfd4+ 128
Rdxa5 128
Bc5# 127
Bc6# 127
Nbc5+ 127
Rbxb8 127
Rdf8+ 127
f8=R 127
hxg8=Q 127
Bf8# 126
N8b7 126
Ng4# 126
Nhxf2 126
R2xf3 126
Rhg4+ 126
Bf1# 125
Kd1+ 125
N2xe4 125
R1xb3 125
R3xf2 125
Rfxg7 125
Rgf3+ 125
Rgxf2 125
c8=R 125
Be2# 124
Nc2# 124
R8xa6 124
Rcxf8 124
Rgb4 124
gxh1=Q 124
Ndxe7+ 123
Rcd8+ 123
Rdc8+ 123
Rexb8 123
Nd7# 122
R3xf4 122
R7xc4 122
Rbg6 122
Rd5# 122
f1=Q# 122
Naxb2 121
Nfg6+ 121
Nfxe2 121
Ngxh4 121
Rhb4 121
Rhxd6 121
Rhxh2+ 121
bxa8=Q+ 121
f1=R 121
R2g7 120
R7g4 120
R8a7+ 120
Rag6 120
gxh8=Q+ 120
Nba8 119
R6xb5 119
Ncxd1 118
Nhxf6+ 118
R4xe3 118
R5xe6 118
R7h6+ 118
Rdxd6+ 118
g8=N+ 118
Ndxb7 117
Ngxf6+ 117
R3xc5 117
R3xe2 117
R4xf3 117
R7xc5 117
Rch4 117
Rch5 117
Rcxa2 117
Rde7+ 117
Rhxe7 117
h8=R 117
Nbxc2 116
Nca8 116
R2h6 116
R8a3+ 116
Rexb5 116
Rfxg3 116
Kg8+ 115
N3f5 115
Raxf6 115
d8=Q# 115
Nbc4+ 114
Ndxf6+ 114
R2h3+ 114
R2xe5 114
R8xb3 114
Rbe8+ 114
Rdxd2+ 114
Rdxd5+ 114
Rfxb2 114
Rxf7# 114
cxb1=Q+ 114
N2xd4 113
N6g7 113
R1xf6 113
Rbxb1 113
Rbxf4 113
Rxc1# 113
h8=Q# 113
Nef7+ 112
Nhg6+ 112
R8xa5 112
Rbd8+ 112
Rcxc7+ 112
Be7# 111
Kh3+ 111
Ncxe4+ 111
R3xb4 111
Rbxb2+ 111
Rec1+ 111
f6# 111
g1=R 111
Nac4+ 110
Nd4# 110
Nxg6# 110
Qxc8# 110
R2xc4 110
Rexe5+ 110
Rfxg2 110
Rha3 110
g8=R 110
h1=R 110
N6xa5 109
Nbxa7 109
Ndc5+ 109
Rbg4 109
Rc3# 109
e1=Q# 109
gxf1=Q 109
Ndxb2 108
R7c6+ 108
Rgxe7 108
a1=Q# 108
d1=N+ 108
Kb4+ 107
Nb3# 107
Nbxa3 107
Ngf2+ 107
Rbxf3 107
Rdxa7 107
a8=Q# 107
b1=R 107
Ndc6+ 106
Qxf5# 106
Rbg1+ 106
N3xa4 105
N7xc6 105
Ngxh6 105
Nhg3+ 105
Nhg5+ 105
R5xc6 105
R7xa6 105
Rbg8+ 105
Rce8+ 105
Rch6 105
Rexb1 105
Kd8+ 104
Nc6# 104
Ndxc2 104
Qxa7# 104
R1d3+ 104
Rbc2+ 104
Rc6# 104
Rga4 104
Rhxg7 104
N3xf4 103
Nc5# 103
Ndxf3+ 103
Ned4+ 103
Nexg2 103
Nfg3+ 103
R5xf4 103
Rgxe8 103
f3# 103
g1=Q# 103
N2xc4 102
N4xf5 102
N7xd5 102
Qxc1# 102
R2h7 102
R2xa3 102
Rexb4 102
Rhxf2 102
Rxg1# 102
exf1=Q 102
N4h6 101
Rec8+ 101
Nbd4+ 100
Ndf2+ 100
R1xa3 100
R7g2 100
R7xe4 100
Rbe1+ 100
Rfxb7 100
Rha5 100
Rhb5 100
d1=R 100
e8=Q# 100
g8=Q# 100
h8=N+ 100
Bxf3# 99
N3g5 99
N4xc5 99
Nbxd6+ 99
Nfxe4+ 99
R2xe4 99
R7xe5 99
R8xa4 99
R8xb4 99
Rbxb7+ 99
Rcxc3+ 99
Rdxd3+ 99
Red2+ 99
Bc4# 98
N4xf3 98
N6f4 98
Ncxd8 98
Ncxe7+ 98
Ndxe6+ 98
R4xf5 98
R5xd3 98
Rcg1+ 98
Rhc1+ 98
N3f2 97
N6b4 97
Nb6# 97
Qxa2# 97
R8b3+ 97
Rdxf7+ 97
Rexg5 97
Rgb5 97
Rhxc3 97
Rhxh6+ 97
N6g4 96
R2h5 96
R2xf4 96
R5xf6 96
R8xg7 96
Rbxf6 96
Rce7+ 96
Rge2+ 96
Rhb6 96
N7h6 95
Ncxe6+ 95
R7xb5 95
Rbc7+ 95
Rde2+ 95
Rdxa2 95
Rfxc5 95
hxg1=Q 95
Bxg2# 94
Nd2# 94
Nhg4+ 94
R6xc4 94
R8d6+ 94
R8g3+ 94
R8xf3 94
R8xg5 94
Rfxa8 94
b4# 94
c8=Q# 94
Bxf7# 93
N1h3 93
Nexc7 93
Nfxg2 93
R4xd6 93
R6xd7 93
Rcxb8 93
Rexe4+ 93
bxa1=Q+ 93
Ba6# 92
Nac6+ 92
Nc4# 92
Ncxb7 92
Ndxf1 92
Nxf2# 92
Qxf4# 92
R2xb4 92
Rexa4 92
Rgxd7 92
Rhxh3+ 92
g1=N+ 92
h6# 92
N2h3 91
Nef2+ 91
Nfxe7+ 91
Nh7# 91
R7g6+ 91
Rdxg7 91
Rga5 91
d1=Q# 91
Ba3# 90
N3xc4 90
N5d3 90
N7xg6 90
Nfxd8 90
R1a6+ 90
R2d7+ 90
Rcd7+ 90
Rdxg2 90
Rgxh4 90
Rhb2+ 90
e5# 90
h3# 90
Nac5+ 89
Ncxd6+ 89
Nec5+ 89
R4xc3 89
R6xf4 89
Rcxc6+ 89
Rdxa3 89
c1=R 89
Nc3# 88
Ncxe5+ 88
Nfxe1 88
Qxh8# 88
R1xg4 88
R6xf7 88
Raxf4 88
Rfb2+ 88
Rfxf4+ 88
Rgxd8 88
Rgxg4+ 88
Rhe7+ 88
Rxg2# 88
Rxg7# 88
N2xc3 87
Nbxc1 87
Ncxa7 87
Ncxb2 87
R1e5+ 87
R2xc5 87
R6xd3 87
Rfxf5+ 87
Rha4 87
c8=N+ 87
Bxf6# 86
N2a4 86
R1xa5 86
R1xg2 86
R6xe7 86
Rc4# 86
Rfxf8+ 86
Rgxg5+ 86
Ndb5+ 85
Nfxg7 85
R1g6+ 85
R2a3+ 85
R4xc6 85
Rexb6 85
Rfe6+ 85
Rgxh6 85
h1=Q# 85
Bb5# 84
Kc1+ 84
N8xe7 84
R3xa4 84
Rag5 84
Rfb1+ 84
Rgf5+ 84
Kh2+ 83
Nfxh4 83
Nge7+ 83
R2g3+ 83
R5xb4 83
R6xa5 83
Rdxd4+ 83
Rfb7+ 83
Rfb8+ 83
Rhxg2 83
Ncxd5+ 82
Nexd8 82
R1d5+ 82
Rb7# 82
Rcd2+ 82
Reg3+ 82
Bb6# 81
Bxg7# 81
Naxb7 81
Ndxb1 81
Ngh6+ 81
Qxd6# 81
R1xa6 81
Rdg6+ 81
Red7+ 81
Rexa5 81
Rgxe1 81
Rgxh7 81
b5# 81
b8=Q# 81
c1=Q# 81
h1=N+ 81
Kxf5+ 80
N5h3 80
Ndc4+ 80
Ndxb8 80
Nxf6# 80
R6h7+ 80
Rga6 80
N3xe5 79
Rcxc4+ 79
Reg1+ 79
Rhxe2 79
c1=N+ 79
Bb4# 78
Bh5# 78
Nexf5+ 78
R1xh5 78
R7xf5 78
Rdxg3 78
Rexg6 78
Rge7+ 78
Rgxc3 78
Rhxg6+ 78
Rxg6# 78
N8h6 77
Nfxe6+ 77
Ngxf3+ 77
Qxe3# 77
R1e3+ 77
R3xe5 77
R7xa5 77
Rah6 77
Rc5# 77
Rexg7 77
Rgxe2 77
Kh7+ 76
N2xg3 76
N5xc4 76
Neg6+ 76
Nexc2 76
Rah4 76
Rb2# 76
Rdg3+ 76
N7xe6 75
Neg3+ 75
Qxa6# 75
R1xb6 75
Raxf7+ 75
Rbg5 75
Rdxg6 75
Reg8+ 75
Rexa7 75
Rfxb3 75
d8=R 75
g7# 75
N5xa4 74
Nxg3# 74
Rbe7+ 74
Rdxg5 74
Rhe2+ 74
Bh4# 73
Kxe5+ 73
Nec7+ 73
Nfxh7 73
Ngxf7+ 73
R3xf5 73
R5xa4 73
Rae2+ 73
Raxa1 73
Rbh4 73
Rcxf7+ 73
Ref8+ 73
Reg6+ 73
Rexg2 73
b1=Q# 73
e1=R 73
Kb7+ 72
N8xe6 72
Nac3+ 72
Nec3+ 72
Nec4+ 72
R2b3+ 72
R2xa4 72
R2xb5 72
Rbe2+ 72
Rce2+ 72
Rdc1+ 72
Ncxa6 71
Ned7+ 71
Ng7# 71
R1g7 71
Rcxg2 71
N3xd2 70
Naxc7 70
Nfxe5+ 70
R1b6+ 70
R2xd6 70
R3xd6 70
R7d3+ 70
Rbf8+ 70
Rbxf5 70
Ref1+ 70
Rhxd7 70
Rxa7# 70
f7# 70
Kc8+ 69
N5xb6 69
N5xf4 69
Nfh6+ 69
R2e7+ 69
R3h2+ 69
R4xa5 69
R6d5+ 69
Rexa3 69
Bd7# 68
N3xh4 68
Ndxc1 68
Ndxe5+ 68
Nec6+ 68
R3h7+ 68
R6e5+ 68
R8d4+ 68
R8e4+ 68
Rae7+ 68
Rag4 68
Rexg4 68
Rfe3+ 68
Rfg3+ 68
g2# 68
Bb3# 67
N3g2 67
N6f7 67
N8xg7 67
Ncxd4+ 67
Nge2+ 67
Ngh3+ 67
R2d6+ 67
R3d4+ 67
R4xe6 67
R5xe3 67
R6xb4 67
R7a6+ 67
Rexh5 67
Rfxg6+ 67
Rfxh5 67
Rgxh3 67
Rhf6+ 67
Rxh8# 67
Bc7# 66
Bd2# 66
Kxf4+ 66
N6f5+ 66
R1xd7 66
R6xh5 66
R7d2+ 66
R8g2 66
Rdxe6+ 66
Rgxd2 66
e8=R 66
N5g3 65
Ncxe1 65
R4xg5 65
fxg1=Q 65
N3f4+ 64
N4f5+ 64
Nexd1 64
Nfxh6 64
Ngh5+ 64
Nh4# 64
R2xg3 64
R3xb5 64
R3xc6 64
R8xa3 64
Rah5 64
Rbh5 64
Rcxf1 64
Rfg6+ 64
Rgf4+ 64
N6xh5 63
Ned2+ 63
Ngxh3 63
Nhxf5+ 63
R3xc2 63
R5xb6 63
R5xc3 63
Rcf1+ 63
Rcf8+ 63
Rfd7+ 63
b1=N+ 63
e4# 63
N5f4+ 62
Nab6+ 62
Ndc3+ 62
Ndxe8 62
Nhf7+ 62
R1xg5 62
R1xh4 62
R5xa6 62
Rbd2+ 62
Rbxg2 62
Rfxh6 62
Rgb7+ 62
Rxf2# 62
Rxf6# 62
Be8# 61
Kb2+ 61
N3b2 61
R8e6+ 61
Raxf5 61
Rbxf8 61
Rdc2+ 61
Rdxf2+ 61
Rexa6 61
N3xd5 60
N4xb3 60
Nbc2+ 60
Nfxg5+ 60
R2h7+ 60
R7f2+ 60
Rbd7+ 60
Rgb2+ 60
Rgxd1 60
Rhb7+ 60
N6xf5 59
Nexg4+ 59
Nfxd6+ 59
Nfxg4+ 59
Nh5# 59
R2f7+ 59
R5xg4 59
R6xa4 59
R6xc3 59
R7b6+ 59
Rhf3+ 59
Bh7# 58
N7xc5 58
Ndxc8 58
Nhxf8 58
Nxf3# 58
R3e4+ 58
R7xb4 58
R7xg6 58
Rb5# 58
Rhxc6 58
Bc2# 57
N4xa5 57
N7f6+ 57
Ncb5+ 57
Nfh5+ 57
Ngxf1 57
Qxc6# 57
R7e2+ 57
R7e3+ 57
Rexa2 57
Rfc7+ 57
Rha6 57
b8=N+ 57
c5# 57
N5h6 56
Ng2# 56
Rad2+ 56
Rfxa7 56
Rfxf1+ 56
Rfxh4 56
Rgxc8 56
fxe8=N+ 56
Ncxb8 55
Nfxd5+ 55
Nhxf1 55
Nhxg6+ 55
Qxb8# 55
Qxe5# 55
R1xg3 55
R2xf5 55
R3f7+ 55
Rab3+ 55
Rb3# 55
Rcxb1 55
Ref3+ 55
Rexg3 55
Rfg8+ 55
Rxg4# 55
b8=N 55
c4# 55
Kh8+ 54
N6a4 54
N6xe4 54
Ncd7+ 54
Ncxa3 54
Nexd6+ 54
Nhxf3+ 54
R1xh3 54
R2e6+ 54
R3xg4 54
R4d3+ 54
R8f4+ 54
R8f6+ 54
Rb4# 54
Rdc7+ 54
Ref6+ 54
Rfe4+ 54
Rfxb4 54
Rfxb6 54
Naxc1 53
Nb5# 53
Nbxd3+ 53
Ncxd3+ 53
Nfxd1 53
Qxe4# 53
R4xb3 53
R8c4+ 53
Rad7+ 53
Rbh6 53
Rde6+ 53
Rdxb8 53
Rexf7+ 53
Rgxc5 53
Rhxg3+ 53
Kxe4+ 52
Kxg4+ 52
N1xg2 52
N3xb4 52
Nbc6+ 52
Nfxh6+ 52
Ngxh2 52
Nhxf4+ 52
Qxb5# 52
R3g7+ 52
R4e3+ 52
R8xh5 52
Raxg7 52
Rbxf1 52
Rfc2+ 52
Rxf3# 52
b3# 52
Bb2# 51
Bb7# 51
Naxc8 51
R2xa5 51
Rcxc5+ 51
Rcxf2+ 51
Rcxg7 51
Rde3+ 51
Rgxc6 51
Rhd7+ 51
Rhxc4 51
Rxe7# 51
e8=R+ 51
exf8=N+ 51
N4xb5 50
N6xd4 50
Nbd7+ 50
R3c4+ 50
R3xa5 50
R3xb2 50
R6xg5 50
Rab5+ 50
Rb6# 50
Rcb2+ 50
Rdxe5+ 50
Rhxc2 50
b7# 50
Ba4# 49
N4b6 49
N4xh5 49
N7e5+ 49
Nb4# 49
Nexf4+ 49
Nfh3+ 49
Nfxh3 49
Qxb6# 49
R6f7+ 49
R8xg6 49
Rbxf7+ 49
Rcg6+ 49
Rdxb1 49
Rdxf6+ 49
Rexh7 49
Rgxc4 49
e7# 49
gxh1=Q+ 49
Kh1+ 48
N7xa6 48
R2xc6 48
R7c3+ 48
Raxg8 48
Rbxb3+ 48
Rcf3+ 48
Rdf6+ 48
Rdxg4 48
Rgxh2 48
Rxb1# 48
Rxg3# 48
Rxg5# 48
Bd8# 47
Bh8+ 47
N5xc6 47
N6xb5 47
N7d5+ 47
N7xd6 47
Nab5+ 47
Naxc2 47
Ncd2+ 47
Ngxe4+ 47
R2c6+ 47
R3d6+ 47
R4xd2 47
R5d6+ 47
R6f5+ 47
R7c2+ 47
R7xh6 47
Rdf3+ 47
Rdxe4+ 47
Rdxh7 47
Reb7+ 47
Red6+ 47
Rexe8+ 47
a8=N 47
N4h3 46
Ndxf7+ 46
Qxb1# 46
Qxh1# 46
R3xb6 46
R6xc7 46
R7xc3 46
Raxf2+ 46
Rbxf2+ 46
Rcg3+ 46
Rexg2+ 46
Rfg1+ 46
Rgxc2 46
Rhxc5 46
a4# 46
f2# 46
gxf1=N+ 46
Bd1# 45
Kxf3+ 45
N4a3 45
N5xb4 45
N8xd6 45
N8xh7 45
Ncxa2 45
Ngxf5+ 45
Qxb4# 45
R1xh2 45
R2xe6 45
R4xa3 45
R5d4+ 45
R5xf3 45
R6e7+ 45
R8xg4 45
Rag6+ 45
Rbg3+ 45
Rec7+ 45
Rfxa3 45
Kb8+ 44
Nbc3+ 44
Ncb6+ 44
Nfh8 44
Nfxe2+ 44
Nh2# 44
R3f4+ 44
R4xa6 44
R4xb6 44
R4xf6 44
R5f6+ 44
R5xb3 44
R6d7+ 44
R6xb7 44
R7xf4 44
Reb2+ 44
Rfd2+ 44
Rhxf7+ 44
Rxa2# 44
Rxa6# 44
d5# 44
dxe8=N+ 44
f8=N 44
Be1# 43
Bxe6# 43
Kxd5+ 43
Kxf6+ 43
N6xg5 43
N7a5 43
Nbxa2 43
Ncb4+ 43
Nexg5+ 43
Nfxh2 43
Ngh7+ 43
Ngxe5+ 43
R1c3+ 43
R1f3+ 43
R2f6+ 43
R2xb6 43
R3e2+ 43
R3xe6 43
R4c3+ 43
R5h6+ 43
R7f3+ 43
R8xg3 43
R8xh4 43
Rac2+ 43
Rac7+ 43
Rag3+ 43
Rexa8 43
Rexh6 43
Rfxa1 43
Rfxe6+ 43
Rgd8+ 43
Rhxg4+ 43
Rxh1# 43
e2# 43
Ba5# 42
Nfh1 42
Ngxf8 42
Ngxh3+ 42
Qxd4# 42
R1f5+ 42
R6e2+ 42
R6g5+ 42
R6xe3 42
R7e5+ 42
R7f5+ 42
Rab4+ 42
Rbf1+ 42
Rdxg7+ 42
Rexh4 42
Rfxh3 42
Rgxf5+ 42
Rhxf2+ 42
g8=N 42
N1xe3 41
N7h5 41
Ngh4+ 41
Ngxh6+ 41
Nxe6# 41
Qxa3# 41
Qxa5# 41
Qxc3# 41
Qxc4# 41
R2xg5 41
R3g4+ 41
R3xf6 41
R3xh4 41
R5e6+ 41
R7h2+ 41
Rbxg7 41
Rdxg6+ 41
Rfe5+ 41
Rgd7+ 41
Rhxd2 41
Rhxh5+ 41
b1=N 41
h7# 41
Bc1# 40
N2xf4 40
N4xg5 40
Ndxe1 40
Nfxd4+ 40
Qxd3# 40
R1h7# 40
R4f3+ 40
R4f7+ 40
Raf6+ 40
Raxe6+ 40
Raxg2 40
Rbg6+ 40
Rcb7+ 40
Rcxh7 40
Rdxe3+ 40
Rdxg1 40
Rdxh4 40
Rgxf7+ 40
Rhf5+ 40
Rhxg5+ 40
Rxa5# 40
a1=N 40
g1=N 40
Kxd4+ 39
Kxg5+ 39
N7xb5 39
Nab4+ 39
Nbxd5+ 39
Ndxf5+ 39
Ng8# 39
Qxd5# 39
R3d7+ 39
R3xa6 39
R4g3+ 39
R4h3+ 39
R5e4+ 39
R6e3+ 39
R6xd2 39
R8c6+ 39
R8xe2 39
R8xh7 39
Rac6+ 39
Rbxb6+ 39
Rcd6+ 39
Rcxe6+ 39
Rcxg3 39
Rdxd1+ 39
Rdxg8 39
Reb1+ 39
Rec2+ 39
Red4+ 39
Rfxe5+ 39
Rgd2+ 39
Rgxg1 39
a8=N+ 39
d8=N 39
gxf8=N+ 39
h1=N 39
Bxg6# 38
Kxe6+ 38
N6xc4 38
Nbxa8 38
Ndxe4+ 38
Nexd3+ 38
Nexd5+ 38
Qxc5# 38
R1xc7 38
R2c7+ 38
R3a4+ 38
R4d6+ 38
R5xf7 38
Rbc6+ 38
Rde5+ 38
Rexg6+ 38
Rfxb5 38
Rfxg3+ 38
Rgxf4+ 38
Rhf4+ 38
Rxa3# 38
Rxd7# 38
a8=R# 38
b2# 38
hxg5# 38
Bxe4# 37
Bxh8+ 37
N4g5+ 37
N5xg6 37
N8xc6 37
Ncxa8 37
Ndb4+ 37
Ndxc7+ 37
Nexg6+ 37
Nf8# 37
R1h5+ 37
R2d4+ 37
R5xd7 37
R7xa4 37
R8xh6 37
Rcxg6 37
Rdxh3 37
Rexg7+ 37
Rfxa4 37
Rge6+ 37
Rgxb3 37
Rgxg8 37
b6# 37
d2# 37
Ka4+ 36
Kxc5+ 36
N5xg4 36
Ndc2+ 36
R2e4+ 36
R2g7+ 36
R4e5+ 36
R4xe2 36
R5d3+ 36
R5e3+ 36
R6c5+ 36
R6g2+ 36
R6xa7 36
Rcb8+ 36
Rcxd5+ 36
Ref4+ 36
Rhc2+ 36
Rhxb8 36
Rxa4# 36
Rxe2# 36
Rxe6# 36
Rxf5# 36
d1=R+ 36
d7# 36
d8=R+ 36
h2# 36
Ka5+ 35
N2xb4 35
Nf1# 35
R1c5+ 35
R3b4+ 35
R3e6+ 35
R5f4+ 35
R6h5+ 35
R7xg5 35
Rcxg2+ 35
Rdxg2+ 35
Rfxh7 35
h8=R# 35
Bh1+ 34
Ka3+ 34
Na3# 34
Nexf7+ 34
Nfe8+ 34
Nxh7# 34
Qxa4# 34
R4d5+ 34
R4xc2 34
R6f3+ 34
R6h2+ 34
R7b2+ 34
Raxg1 34
Rce3+ 34
Rdxf3+ 34
Red3+ 34
Red5+ 34
Rexd5+ 34
Rfxa2 34
Rfxg5+ 34
Rhc7+ 34
Rhxc7 34
Rxe3# 34
Rxf4# 34
a1=N+ 34
a1=R# 34
d4# 34
e1=R+ 34
exf8=R+ 34
h1=R# 34
N3e4+ 33
N3xg4 33
N4xc3 33
N6g4+ 33
N7xf5 33
Nbxc7+ 33
Ncb3+ 33
Nec2+ 33
Nfd2+ 33
Nfxd3+ 33
Nhf2+ 33
Nhxg3+ 33
Nxc7# 33
R4g7+ 33
R4h7+ 33
R4xf2 33
R5d2+ 33
R5f3+ 33
R5f7+ 33
R5xb7 33
R6xg4 33
R6xg7 33
R7d5+ 33
Rcg2# 33
Rcxg7+ 33
Rdxd8+ 33
Rdxh6 33
Rexf5+ 33
Rfxa6 33
Rfxg2+ 33
Rgxb7 33
Rxb8# 33
c8=R+ 33
exf1=N+ 33
f8=R+ 33
hxg4# 33
Bxe3# 32
Bxf4# 32
Kxe3+ 32
Kxh4+ 32
N2e4+ 32
Nbd2+ 32
Ndxf4+ 32
Nxh6# 32
R4e6+ 32
R4f5+ 32
R4f6+ 32
R5d7+ 32
R5h2+ 32
R7d4+ 32
R7xb3 32
R7xd3 32
R7xe3 32
R8h6+ 32
R8xd2 32
Rbxc6+ 32
Reg5+ 32
Rexf6+ 32
Rfg5+ 32
Rgd1+ 32
Rgxc7 32
Rhd2+ 32
a5# 32
b8=R+ 32
c7# 32
c8=N 32
Ba8+ 31
Kb1+ 31
Kxh5+ 31
N2xe3 31
N3xc5 31
N5e4+ 31
N5f6+ 31
N5g6+ 31
N7g5+ 31
Ndxe3+ 31
Ndxf2+ 31
Nexg1 31
Ngxe8 31
Qaa7 31
Qbb2 31
R1xd7+ 31
R4h6+ 31
R4xc7 31
R4xd7 31
R5g2+ 31
R5xf2 31
R6xb3 31
Rab6+ 31
Rbf6+ 31
Rbxb4+ 31
Rcd3+ 31
Rcg7# 31
Rcxd4+ 31
Rexf2+ 31
Rgc7+ 31
Rgc8+ 31
Rhb8+ 31
Rhxe6+ 31
d1=N 31
e8=N 31
N2d4+ 30
N2xa3 30
N3e5+ 30
N5b3 30
N5xe6 30
Naxb8 30
Nexf8 30
Nfd7+ 30
Nfxg6+ 30
Ngxe3+ 30
R1e4+ 30
R1h3+ 30
R3c7+ 30
R3f2+ 30
R3h4+ 30
R4e7+ 30
R4xb2 30
R5xa3 30
R5xd2 30
R6xf3 30
R8e5+ 30
Raf3+ 30
Rbxe7+ 30
Rde4+ 30
Rdf5+ 30
Rexd4+ 30
Rexh2 30
Rexh3 30
Rfxa5 30
Rfxg4+ 30
Rgxb2 30
c1=N 30
f8=B+ 30
Bxd5# 29
Bxf2# 29
Kxd6+ 29
N3a5 29
N4h5+ 29
N4xg3 29
N6b7 29
N8xa6 29
N8xc7 29
N8xf6 29
Nac7+ 29
Ncxe3+ 29
Nexg8 29
Ngxf2+ 29
Nxd6# 29
Nxe7# 29
Qcc2+ 29
Qxa1# 29
Qxa8# 29
R2d5+ 29
R2xc7 29
R5h7+ 29
R5xe7 29
R6d3+ 29
R7xa3 29
R7xf3 29
R8d5+ 29
R8h4+ 29
Rbc5+ 29
Rbxg3 29
Rcf6+ 29
Rcxf6+ 29
Rcxg5 29
Rdg7# 29
Rdxh5 29
Reb8+ 29
Rgc2+ 29
Rhxg2+ 29
Rxb7# 29
Rxe5# 29
a3# 29
f1=R+ 29
Bc8# 28
Bxe5# 28
Bxg4# 28
Bxg5# 28
N2h3+ 28
N6e5+ 28
Nab3+ 28
Nba1 28
Nca1 28
Nde8+ 28
Ndxe2+ 28
Nexg3+ 28
Qxb3# 28
R1d4+ 28
R1xb7 28
R2xh3 28
R3e7+ 28
R3f6+ 28
R3xg2 28
R3xg5 28
R4a3+ 28
R4c6+ 28
R4h2+ 28
R5c3+ 28
R6a7+ 28
R6c2+ 28
R6e4+ 28
R6f2+ 28
Raxd6+ 28
Rcxd7+ 28
Rcxe7+ 28
Rcxg4 28
Rdb7+ 28
Rdxf5+ 28
Ref5+ 28
Reg4+ 28
Rexe1+ 28
Rexf8+ 28
Rhxb2 28
Rhxf6+ 28
Rxc7# 28
c1=R+ 28
e1=N 28
e6# 28
fxe1=N+ 28
g1=R+ 28
h8=N 28
Bg8# 27
Kxc4+ 27
N2f3+ 27
N2h4 27
N3d5+ 27
N4d5+ 27
N4e5+ 27
Na2# 27
Nb2# 27
Ng1# 27
Ngh8 27
Ngxf4+ 27
Nhxf7+ 27
R1a3+ 27
R1b3+ 27
R1f7# 27
R2f4+ 27
R2g6+ 27
R4d2+ 27
R4xb7 27
R5b6+ 27
R6d4+ 27
R7a2+ 27
R7c5+ 27
R7h3+ 27
R7xh5 27
R8xa2 27
Rbf3+ 27
Rbxe6+ 27
Rbxg2+ 27
Rcb1+ 27
Rcxf3+ 27
Rdxg3+ 27
Rexf4+ 27
Rfxe4+ 27
Rfxh3+ 27
Rgxc1 27
Rhb1+ 27
Rhxf3+ 27
Rhxg7+ 27
b1=R+ 27
f1=N 27
Bxc6# 26
Bxd6# 26
N1xc3 26
N3g5+ 26
